#pragma once
#include <cstdint>
#include "!GlobalTypes.hpp"

// /////////////////////////////////////////////////////////////
// Binary: client.dll
// Classes count: 210
// Enums count: 3
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

// Registered binary: client.dll (project 'client')
// Enumerator count: 9
// Alignment: 4
// Size: 0x4
enum class NPC_STATE : uint32_t
{
	NPC_STATE_INVALID = 0xffffffffffffffff,
	NPC_STATE_NONE = 0x0,
	NPC_STATE_IDLE = 0x1,
	NPC_STATE_ALERT = 0x2,
	NPC_STATE_COMBAT = 0x3,
	NPC_STATE_SCRIPT = 0x4,
	NPC_STATE_PLAYDEAD = 0x5,
	NPC_STATE_PRONE = 0x6,
	NPC_STATE_DEAD = 0x7,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 5
// Alignment: 4
// Size: 0x4
enum class C_BaseCombatCharacter__WaterWakeMode_t : uint32_t
{
	C_BaseCombatCharacter::WATER_WAKE_NONE = 0x0,
	C_BaseCombatCharacter::WATER_WAKE_IDLE = 0x1,
	C_BaseCombatCharacter::WATER_WAKE_WALKING = 0x2,
	C_BaseCombatCharacter::WATER_WAKE_RUNNING = 0x3,
	C_BaseCombatCharacter::WATER_WAKE_WATER_OVERHEAD = 0x4,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 13
// Alignment: 4
// Size: 0x4
enum class PostProcessParameterNames_t : uint32_t
{
	PPPN_FADE_TIME = 0x0,
	PPPN_LOCAL_CONTRAST_STRENGTH = 0x1,
	PPPN_LOCAL_CONTRAST_EDGE_STRENGTH = 0x2,
	PPPN_VIGNETTE_START = 0x3,
	PPPN_VIGNETTE_END = 0x4,
	PPPN_VIGNETTE_BLUR_STRENGTH = 0x5,
	PPPN_FADE_TO_BLACK_STRENGTH = 0x6,
	PPPN_DEPTH_BLUR_FOCAL_DISTANCE = 0x7,
	PPPN_DEPTH_BLUR_STRENGTH = 0x8,
	PPPN_SCREEN_BLUR_STRENGTH = 0x9,
	PPPN_FILM_GRAIN_STRENGTH = 0xa,
	PPPN_TOP_VIGNETTE_STRENGTH = 0xb,
	POST_PROCESS_PARAMETER_COUNT = 0xc,
};

struct ChangeAccessorFieldPathIndex_t;
struct sky3dparams_t;
struct audioparams_t;
struct C_RopeKeyframe;
struct CDecalInfo;
struct C_BasePlayer;
struct CNetworkedSequenceOperation;
struct C_BaseAnimatingController;
struct ParticleIndex_t;
struct CEntityIdentity;
struct CScriptComponent;
struct C_CSequenceTransitioner2;
struct CGameSceneNode;
struct CNetworkVarChainer;
struct CSkeletonInstance;
struct CBodyComponent;
struct CNetworkTransmitComponent;
struct CRenderComponent;
struct CCollisionProperty;
struct CNetworkVelocityVector;
struct CParticleProperty;
struct C_CEnvWindShared;
struct C_SkyCamera;
struct CInterpolatedValue;
struct CAttributeList;
struct C_SingleplayRules;
struct CEntityIOOutput;
struct CTimeOfDayDynamicKeys;
struct fogparams_t;
struct C_PointCamera;
struct C_BaseAnimatingOverlayController;
struct CGlowProperty;
struct CNetworkViewOffsetVector;
struct CClientAlphaProperty;
struct C_RopeKeyframe::CPhysicsDelegate;
struct CPointOffScreenIndicatorUi;
struct C_PointClientUIWorldPanel;
struct CLightComponent;
struct CHitboxComponent;
struct C_BaseAnimating;
struct CBaseAnimatingEasings_t;
struct CInteractionManager;
struct C_CombatWeaponClone;
struct CAttributeContainer;
struct PlayerSlot_t;
struct DACAbilityID_t;
struct CountdownTimer;
struct UnderlordID_t;
struct C_PlayerLocalData;
struct C_PlayerState;
struct C_CommandContext;
struct TimedEvent;
struct C_fogplayerparams_t;

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x48
// 
// MNetworkVarNames "ModelConfigHandle_t m_Handle"
// MNetworkVarNames "string_t m_Name"
// MNetworkVarNames "CHandle< CBaseModelEntity > m_AssociatedEntities"
// MNetworkVarNames "string_t m_AssociatedEntityNames"
struct ActiveModelConfig_t
{
private:
	[[maybe_unused]] uint8_t __pad0000[0xc]; // 0x0
public:
	// MNetworkEnable
	// MNetworkEnable
	ModelConfigHandle_t m_Handle; // 0xc	
	// MNetworkEnable
	// MNetworkEnable
	CUtlSymbolLarge m_Name; // 0x10	
	// MNetworkEnable
	// MNetworkEnable
	CUtlVector< CHandle< C_BaseModelEntity > > m_AssociatedEntities; // 0x18	
	// MNetworkEnable
	// MNetworkEnable
	CUtlVector< CUtlSymbolLarge > m_AssociatedEntityNames; // 0x30	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x40
// Has VTable
// 
// MNetworkVarNames "int m_nChainIndex"
// MNetworkVarNames "int m_nRuleIndex"
// MNetworkVarNames "Vector m_vTargetPosition"
// MNetworkVarNames "Quaternion m_qTargetOrientation"
// MNetworkVarNames "float m_flWeight"
// MNetworkVarNames "bool m_bIsValid"
class CNetworkedIKProceduralTargetContext
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x14]; // 0x0
public:
	// MNetworkEnable
	// MNetworkEnable
	int32_t m_nChainIndex; // 0x14	
	// MNetworkEnable
	// MNetworkEnable
	int32_t m_nRuleIndex; // 0x18	
	// MNetworkEnable
	// MNetworkEnable
	Vector m_vTargetPosition; // 0x1c	
	// MNetworkEnable
	// MNetworkEnable
	Quaternion m_qTargetOrientation; // 0x28	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkPriority "96"
	float m_flWeight; // 0x38	
	// MNetworkEnable
	// MNetworkEnable
	bool m_bIsValid; // 0x3c	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0xbc0
// Has VTable
// 
// MNetworkVarNames "bool m_NetBoolVariables"
// MNetworkVarNames "byte m_NetByteVariables"
// MNetworkVarNames "int32 m_NetIntVariables"
// MNetworkVarNames "float m_NetFloatVariables"
// MNetworkVarNames "Vector m_NetVectorVariables"
// MNetworkVarNames "Quaternion m_NetQuaternionVariables"
// MNetworkVarNames "bool m_PredNetBoolVariables"
// MNetworkVarNames "byte m_PredNetByteVariables"
// MNetworkVarNames "int32 m_PredNetIntVariables"
// MNetworkVarNames "float m_PredNetFloatVariables"
// MNetworkVarNames "Vector m_PredNetVectorVariables"
// MNetworkVarNames "Quaternion m_PredNetQuaternionVariables"
// MNetworkVarNames "float m_flLastTeleportTime"
class CAnimGraphNetworkedVariables
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_BoolVariables"
	CUtlVector< bool > m_NetBoolVariables; // 0x8	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_ByteVariables"
	CUtlVector< uint8 > m_NetByteVariables; // 0x20	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_IntVariables"
	CUtlVector< int32 > m_NetIntVariables; // 0x38	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_FloatVariables"
	CUtlVector< float32 > m_NetFloatVariables; // 0x50	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_VectorVariables"
	CUtlVector< Vector > m_NetVectorVariables; // 0x68	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_QuaternionVariables"
	CUtlVector< Quaternion > m_NetQuaternionVariables; // 0x80	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_PredBoolVariables"
	CUtlVector< bool > m_PredNetBoolVariables; // 0x98	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_PredByteVariables"
	CUtlVector< uint8 > m_PredNetByteVariables; // 0xb0	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_PredIntVariables"
	CUtlVector< int32 > m_PredNetIntVariables; // 0xc8	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_PredFloatVariables"
	CUtlVector< float32 > m_PredNetFloatVariables; // 0xe0	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_PredVectorVariables"
	CUtlVector< Vector > m_PredNetVectorVariables; // 0xf8	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	// MNetworkChangeCallback "OnNetVarChanged"
	// MNetworkAlias "m_PredQuaternionVariables"
	CUtlVector< Quaternion > m_PredNetQuaternionVariables; // 0x110	
	CUtlVector< bool > m_LocalPredBoolVariables; // 0x128	
	CUtlVector< uint8 > m_LocalPredByteVariables; // 0x140	
	CUtlVector< int32 > m_LocalPredIntVariables; // 0x158	
	CUtlVector< float32 > m_LocalPredFloatVariables; // 0x170	
	CUtlVector< Vector > m_LocalPredVectorVariables; // 0x188	
	CUtlVector< Quaternion > m_LocalPredQuaternionVariables; // 0x1a0	
private:
	[[maybe_unused]] uint8_t __pad01b8[0x9fc]; // 0x1b8
public:
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "animationgraph"
	float m_flLastTeleportTime; // 0xbb4	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x20
class C_BaseFlex::Emphasized_Phoneme
{
public:
	CUtlString m_sClassName; // 0x0	
	float m_flAmount; // 0x18	
	bool m_bRequired; // 0x1c	
	bool m_bBasechecked; // 0x1d	
	bool m_bValid; // 0x1e	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x358
class C_CommandContext
{
public:
	bool needsprocessing; // 0x0	
	int32_t command_number; // 0x350	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x1e8
// Has VTable
// 
// MNetworkVarNames "CHandle< C_BaseEntity> m_hTargetEntity"
// MNetworkVarNames "bool m_bState"
// MNetworkVarNames "bool m_bAlwaysUpdate"
// MNetworkVarNames "float32 m_flLightFOV"
// MNetworkVarNames "bool m_bEnableShadows"
// MNetworkVarNames "bool m_bSimpleProjection"
// MNetworkVarNames "bool m_bLightOnlyTarget"
// MNetworkVarNames "bool m_bLightWorld"
// MNetworkVarNames "bool m_bCameraSpace"
// MNetworkVarNames "float32 m_flBrightnessScale"
// MNetworkVarNames "Color m_LightColor"
// MNetworkVarNames "float32 m_flIntensity"
// MNetworkVarNames "float32 m_flLinearAttenuation"
// MNetworkVarNames "float32 m_flQuadraticAttenuation"
// MNetworkVarNames "bool m_bVolumetric"
// MNetworkVarNames "float32 m_flVolumetricIntensity"
// MNetworkVarNames "float32 m_flNoiseStrength"
// MNetworkVarNames "float32 m_flFlashlightTime"
// MNetworkVarNames "uint32 m_nNumPlanes"
// MNetworkVarNames "float32 m_flPlaneOffset"
// MNetworkVarNames "float32 m_flColorTransitionTime"
// MNetworkVarNames "float32 m_flAmbient"
// MNetworkVarNames "char m_SpotlightTextureName"
// MNetworkVarNames "int32 m_nSpotlightTextureFrame"
// MNetworkVarNames "uint32 m_nShadowQuality"
// MNetworkVarNames "float32 m_flNearZ"
// MNetworkVarNames "float32 m_flFarZ"
// MNetworkVarNames "float32 m_flProjectionSize"
// MNetworkVarNames "float32 m_flRotation"
// MNetworkVarNames "bool m_bFlipHorizontal"
class CProjectedTextureBase
{
private:
	[[maybe_unused]] uint8_t __pad0000[0xc]; // 0x0
public:
	// MNetworkEnable
	// MNetworkEnable
	CHandle< C_BaseEntity > m_hTargetEntity; // 0xc	
	// MNetworkEnable
	// MNetworkEnable
	bool m_bState; // 0x10	
	// MNetworkEnable
	// MNetworkEnable
	bool m_bAlwaysUpdate; // 0x11	
private:
	[[maybe_unused]] uint8_t __pad0012[0x2]; // 0x12
public:
	// MNetworkEnable
	// MNetworkEnable
	float m_flLightFOV; // 0x14	
	// MNetworkEnable
	// MNetworkEnable
	bool m_bEnableShadows; // 0x18	
	// MNetworkEnable
	// MNetworkEnable
	bool m_bSimpleProjection; // 0x19	
	// MNetworkEnable
	// MNetworkEnable
	bool m_bLightOnlyTarget; // 0x1a	
	// MNetworkEnable
	// MNetworkEnable
	bool m_bLightWorld; // 0x1b	
	// MNetworkEnable
	// MNetworkEnable
	bool m_bCameraSpace; // 0x1c	
private:
	[[maybe_unused]] uint8_t __pad001d[0x3]; // 0x1d
public:
	// MNetworkEnable
	// MNetworkEnable
	float m_flBrightnessScale; // 0x20	
	// MNetworkEnable
	// MNetworkEnable
	Color m_LightColor; // 0x24	
	// MNetworkEnable
	// MNetworkEnable
	float m_flIntensity; // 0x28	
	// MNetworkEnable
	// MNetworkEnable
	float m_flLinearAttenuation; // 0x2c	
	// MNetworkEnable
	// MNetworkEnable
	float m_flQuadraticAttenuation; // 0x30	
	// MNetworkEnable
	// MNetworkEnable
	bool m_bVolumetric; // 0x34	
private:
	[[maybe_unused]] uint8_t __pad0035[0x3]; // 0x35
public:
	// MNetworkEnable
	// MNetworkEnable
	float m_flVolumetricIntensity; // 0x38	
	// MNetworkEnable
	// MNetworkEnable
	float m_flNoiseStrength; // 0x3c	
	// MNetworkEnable
	// MNetworkEnable
	float m_flFlashlightTime; // 0x40	
	// MNetworkEnable
	// MNetworkEnable
	uint32_t m_nNumPlanes; // 0x44	
	// MNetworkEnable
	// MNetworkEnable
	float m_flPlaneOffset; // 0x48	
	// MNetworkEnable
	// MNetworkEnable
	float m_flColorTransitionTime; // 0x4c	
	// MNetworkEnable
	// MNetworkEnable
	float m_flAmbient; // 0x50	
	// MNetworkEnable
	// MNetworkEnable
	char m_SpotlightTextureName[260]; // 0x54	
	// MNetworkEnable
	// MNetworkEnable
	int32_t m_nSpotlightTextureFrame; // 0x158	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "1"
	uint32_t m_nShadowQuality; // 0x15c	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "16"
	// MNetworkMinValue "0.000000"
	// MNetworkMaxValue "500.000000"
	// MNetworkEncodeFlags "1"
	float m_flNearZ; // 0x160	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "18"
	// MNetworkMinValue "0.000000"
	// MNetworkMaxValue "1500.000000"
	// MNetworkEncodeFlags "1"
	float m_flFarZ; // 0x164	
	// MNetworkEnable
	// MNetworkEnable
	float m_flProjectionSize; // 0x168	
	// MNetworkEnable
	// MNetworkEnable
	float m_flRotation; // 0x16c	
	// MNetworkEnable
	// MNetworkEnable
	bool m_bFlipHorizontal; // 0x170	
	
	// Static fields:
	static float &Get_m_flVisibleBBoxMinHeight(){return *reinterpret_cast<float*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CProjectedTextureBase")->m_static_fields[0]->m_instance);};
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x1e8
// Has VTable
// 
// MNetworkExcludeByUserGroup "FogController"
// MNetworkVarNames "uint8 m_chAreaBits"
// MNetworkVarNames "uint8 m_chAreaPortalBits"
// MNetworkVarNames "float32 m_flFOVRate"
// MNetworkVarNames "uint32 m_iHideHUD"
// MNetworkVarNames "uint32 m_nDuckTimeMsecs"
// MNetworkVarNames "uint32 m_nDuckJumpTimeMsecs"
// MNetworkVarNames "uint32 m_nJumpTimeMsecs"
// MNetworkVarNames "float32 m_flFallVelocity"
// MNetworkVarNames "float32 m_flStepSize"
// MNetworkVarNames "bool m_bDucked"
// MNetworkVarNames "bool m_bDucking"
// MNetworkVarNames "bool m_bInDuckJump"
// MNetworkVarNames "bool m_bDrawViewmodel"
// MNetworkVarNames "bool m_bWearingSuit"
// MNetworkVarNames "bool m_bPoisoned"
// MNetworkVarNames "bool m_bAllowAutoMovement"
// MNetworkVarNames "bool m_bSlowMovement"
// MNetworkVarNames "bool m_bAutoAimTarget"
// MNetworkVarNames "sky3dparams_t m_skybox3d"
// MNetworkVarNames "audioparams_t m_audio"
// MNetworkVarNames "CHandle<C_PostProcessingVolume> m_PostProcessingVolumes"
class C_PlayerLocalData
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	ChangeAccessorFieldPathIndex_t m_NetworkVar_PathIndex; // 0x8	
private:
	[[maybe_unused]] uint8_t __pad000a[0xe]; // 0xa
public:
	// MNetworkEnable
	// MNetworkEnable
	uint8_t m_chAreaBits[32]; // 0x18	
	// MNetworkEnable
	// MNetworkEnable
	uint8_t m_chAreaPortalBits[24]; // 0x38	
	int32_t m_nStepside; // 0x50	
	int32_t m_nOldButtons; // 0x54	
	// MNetworkEnable
	// MNetworkEnable
	float m_flFOVRate; // 0x58	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "12"
	uint32_t m_iHideHUD; // 0x5c	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	// MNetworkPriority "64"
	uint32_t m_nDuckTimeMsecs; // 0x60	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	uint32_t m_nDuckJumpTimeMsecs; // 0x64	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	uint32_t m_nJumpTimeMsecs; // 0x68	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "17"
	// MNetworkMinValue "-4096.000000"
	// MNetworkMaxValue "4096.000000"
	float m_flFallVelocity; // 0x6c	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "16"
	// MNetworkEncodeFlags "2"
	// MNetworkMinValue "0.000000"
	// MNetworkMaxValue "128.000000"
	float m_flStepSize; // 0x70	
private:
	[[maybe_unused]] uint8_t __pad0074[0x4]; // 0x74
public:
	// MNetworkEnable
	// MNetworkPriority "64"
	// MNetworkBitCount "32"
	QAngle m_vecPunchAngle; // 0x78	
private:
	[[maybe_unused]] uint8_t __pad0084[0xc]; // 0x84
public:
	// MNetworkEnable
	// MNetworkBitCount "32"
	QAngle m_vecPunchAngleVel; // 0x90	
private:
	[[maybe_unused]] uint8_t __pad009c[0xc]; // 0x9c
public:
	// MNetworkEnable
	// MNetworkEnable
	bool m_bDucked; // 0xa8	
	// MNetworkEnable
	// MNetworkEnable
	bool m_bDucking; // 0xa9	
	// MNetworkEnable
	// MNetworkEnable
	bool m_bInDuckJump; // 0xaa	
	// MNetworkEnable
	// MNetworkEnable
	bool m_bDrawViewmodel; // 0xab	
	// MNetworkEnable
	// MNetworkEnable
	bool m_bWearingSuit; // 0xac	
	// MNetworkEnable
	// MNetworkEnable
	bool m_bPoisoned; // 0xad	
	// MNetworkEnable
	// MNetworkEnable
	bool m_bAllowAutoMovement; // 0xae	
	// MNetworkEnable
	// MNetworkEnable
	bool m_bSlowMovement; // 0xaf	
	// MNetworkEnable
	// MNetworkEnable
	bool m_bAutoAimTarget; // 0xb0	
private:
	[[maybe_unused]] uint8_t __pad00b1[0x7]; // 0xb1
public:
	// MNetworkEnable
	// MNetworkEnable
	sky3dparams_t m_skybox3d; // 0xb8	
	// MNetworkEnable
	// MNetworkEnable
	audioparams_t m_audio; // 0x140	
	// MNetworkEnable
	// MNetworkEnable
	CUtlVector< CHandle< C_PostProcessingVolume > > m_PostProcessingVolumes; // 0x1b8	
private:
	[[maybe_unused]] uint8_t __pad01d0[0x4]; // 0x1d0
public:
	bool m_bInLanding; // 0x1d4	
private:
	[[maybe_unused]] uint8_t __pad01d5[0x3]; // 0x1d5
public:
	float m_flLandingTime; // 0x1d8	
	Vector m_vecClientBaseVelocity; // 0x1dc	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x38
// Has VTable
// Has Trivial Destructor
// 
// MNetworkVarNames "float32 m_flParameters"
struct PostProcessParameters_t
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkEnable
	// MNetworkEnable
	float m_flParameters[12]; // 0x8	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x10
// Has VTable
// Has Trivial Destructor
class C_RopeKeyframe::CPhysicsDelegate
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	C_RopeKeyframe* m_pKeyframe; // 0x8	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x18
// Has Trivial Constructor
// Has Trivial Destructor
struct C_SceneEntity__QueuedEvents_t
{
public:
	float starttime; // 0x0	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x308
// Has VTable
class CFlashlightEffect
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	bool m_bIsOn; // 0x8	
private:
	[[maybe_unused]] uint8_t __pad0009[0xf]; // 0x9
public:
	bool m_bMuzzleFlashEnabled; // 0x18	
private:
	[[maybe_unused]] uint8_t __pad0019[0x3]; // 0x19
public:
	float m_flMuzzleFlashBrightness; // 0x1c	
	Quaternion m_quatMuzzleFlashOrientation; // 0x20	
	Vector m_vecMuzzleFlashOrigin; // 0x30	
	float m_flDT; // 0x3c	
	float m_flFov; // 0x40	
	float m_flFarZ; // 0x44	
	float m_flLinearAtten; // 0x48	
	bool m_bCastsShadows; // 0x4c	
private:
	[[maybe_unused]] uint8_t __pad004d[0x3]; // 0x4d
public:
	float m_flCurrentPullBackDist; // 0x50	
private:
	[[maybe_unused]] uint8_t __pad0054[0x4]; // 0x54
public:
	CStrongHandle< InfoForResourceTypeCTextureBase > m_FlashlightTexture; // 0x58	
	CStrongHandle< InfoForResourceTypeCTextureBase > m_MuzzleFlashTexture; // 0x60	
	CWeakHandle< InfoForResourceTypeCTextureBase > m_hCurrentFlashlightTexture; // 0x68	
	char m_textureName[64]; // 0x70	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x308
// Has VTable
class CHeadlightEffect : public CFlashlightEffect
{
public:
	// No schema binary for binding
};

// Registered binary: client.dll (project 'client')
// Alignment: 4
// Size: 0x14
// Has Trivial Destructor
class CInterpolatedValue
{
public:
	float m_flStartTime; // 0x0	
	float m_flEndTime; // 0x4	
	float m_flStartValue; // 0x8	
	float m_flEndValue; // 0xc	
	int32_t m_nInterpType; // 0x10	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x20
class CGlowSprite
{
public:
	Vector m_vColor; // 0x0	
	float m_flHorzSize; // 0xc	
	float m_flVertSize; // 0x10	
private:
	[[maybe_unused]] uint8_t __pad0014[0x4]; // 0x14
public:
	CStrongHandle< InfoForResourceTypeIMaterial2 > m_hMaterial; // 0x18	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0xd0
// Has VTable
class CGlowOverlay
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	Vector m_vPos; // 0x8	
	bool m_bDirectional; // 0x14	
private:
	[[maybe_unused]] uint8_t __pad0015[0x3]; // 0x15
public:
	Vector m_vDirection; // 0x18	
	bool m_bInSky; // 0x24	
private:
	[[maybe_unused]] uint8_t __pad0025[0x3]; // 0x25
public:
	float m_skyObstructionScale; // 0x28	
private:
	[[maybe_unused]] uint8_t __pad002c[0x4]; // 0x2c
public:
	// -> m_vColor - 0x30
	// -> m_flHorzSize - 0x3c
	// -> m_flVertSize - 0x40
	// -> m_hMaterial - 0x48
	CGlowSprite m_Sprites[4]; // 0x30	
	int32_t m_nSprites; // 0xb0	
	float m_flProxyRadius; // 0xb4	
	float m_flHDRColorScale; // 0xb8	
	float m_flGlowObstructionScale; // 0xbc	
	bool m_bCacheGlowObstruction; // 0xc0	
	bool m_bCacheSkyObstruction; // 0xc1	
	int16_t m_bActivated; // 0xc2	
	int16_t m_ListIndex; // 0xc4	
private:
	[[maybe_unused]] uint8_t __pad00c6[0x2]; // 0xc6
public:
	int32_t m_queryHandle; // 0xc8	
};

// Registered binary: client.dll (project 'client')
// Alignment: 4
// Size: 0x8
// Has Trivial Destructor
class TimedEvent
{
public:
	float m_TimeBetweenEvents; // 0x0	
	float m_fNextEvent; // 0x4	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x20
// Has VTable
// Has Trivial Destructor
class CViewAngleKeyFrame
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	QAngle m_vecAngles; // 0x8	
	float m_flTime; // 0x14	
	int32_t m_iFlags; // 0x18	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x8
// Has VTable
// Is Abstract
// Has Trivial Destructor
class IClientAlphaProperty
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// No schema binary for binding
};

// Registered binary: client.dll (project 'client')
// Alignment: 4
// Size: 0x60
// Has Trivial Destructor
class JiggleData
{
public:
	int32_t bone; // 0x0	
	int32_t id; // 0x4	
	float lastUpdate; // 0x8	
	Vector basePos; // 0xc	
	Vector baseLastPos; // 0x18	
	Vector baseVel; // 0x24	
	Vector baseAccel; // 0x30	
	Vector tipPos; // 0x3c	
	Vector tipVel; // 0x48	
	Vector tipAccel; // 0x54	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x28
class CJiggleBones
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x28]; // 0x0
public:
	// No schema binary for binding
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x18
// Has VTable
class C_PlayerState
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	bool deadflag; // 0x8	
	bool hltv; // 0x9	
private:
	[[maybe_unused]] uint8_t __pad000a[0x2]; // 0xa
public:
	QAngle v_angle; // 0xc	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x98
class CDecalInfo
{
public:
	float m_flAnimationScale; // 0x0	
	float m_flAnimationLifeSpan; // 0x4	
	float m_flPlaceTime; // 0x8	
	float m_flFadeStartTime; // 0xc	
	float m_flFadeDuration; // 0x10	
	int32_t m_nVBSlot; // 0x14	
	int32_t m_nBoneIndex; // 0x18	
private:
	[[maybe_unused]] uint8_t __pad001c[0xc]; // 0x1c
public:
	CDecalInfo* m_pNext; // 0x28	
	CDecalInfo* m_pPrev; // 0x30	
private:
	[[maybe_unused]] uint8_t __pad0038[0x58]; // 0x38
public:
	int32_t m_nDecalMaterialIndex; // 0x90	
	
	// Datamap fields:
	// void m_decalEvent; // 0x38
	// void m_hProjectedDecal; // 0x20
};

// Registered binary: client.dll (project 'client')
// Alignment: 4
// Size: 0x8
// Has Trivial Constructor
// Has Trivial Destructor
struct C_CEnvWindShared__WindAveEvent_t
{
public:
	float m_flStartWindSpeed; // 0x0	
	float m_flAveWindSpeed; // 0x4	
};

// Registered binary: client.dll (project 'client')
// Alignment: 4
// Size: 0x8
// Has Trivial Constructor
// Has Trivial Destructor
struct C_CEnvWindShared__WindVariationEvent_t
{
public:
	float m_flWindAngleVariation; // 0x0	
	float m_flWindSpeedVariation; // 0x4	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x240
// Has VTable
// 
// MNetworkVarNames "float32 m_flStartTime"
// MNetworkVarNames "uint32 m_iWindSeed"
// MNetworkVarNames "uint16 m_iMinWind"
// MNetworkVarNames "uint16 m_iMaxWind"
// MNetworkVarNames "int32 m_windRadius"
// MNetworkVarNames "uint16 m_iMinGust"
// MNetworkVarNames "uint16 m_iMaxGust"
// MNetworkVarNames "float32 m_flMinGustDelay"
// MNetworkVarNames "float32 m_flMaxGustDelay"
// MNetworkVarNames "float32 m_flGustDuration"
// MNetworkVarNames "uint16 m_iGustDirChange"
// MNetworkVarNames "Vector m_location"
// MNetworkVarNames "uint16 m_iInitialWindDir"
// MNetworkVarNames "float32 m_flInitialWindSpeed"
class C_CEnvWindShared
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkEnable
	// MNetworkEnable
	float m_flStartTime; // 0x8	
	// MNetworkEnable
	// MNetworkEnable
	uint32_t m_iWindSeed; // 0xc	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	uint16_t m_iMinWind; // 0x10	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	uint16_t m_iMaxWind; // 0x12	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "14"
	int32_t m_windRadius; // 0x14	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	uint16_t m_iMinGust; // 0x18	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "10"
	uint16_t m_iMaxGust; // 0x1a	
	// MNetworkEnable
	// MNetworkEnable
	float m_flMinGustDelay; // 0x1c	
	// MNetworkEnable
	// MNetworkEnable
	float m_flMaxGustDelay; // 0x20	
	// MNetworkEnable
	// MNetworkEnable
	float m_flGustDuration; // 0x24	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "9"
	uint16_t m_iGustDirChange; // 0x28	
private:
	[[maybe_unused]] uint8_t __pad002a[0x2]; // 0x2a
public:
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkEncoder "coord"
	Vector m_location; // 0x2c	
	int32_t m_iszGustSound; // 0x38	
	int32_t m_iWindDir; // 0x3c	
	float m_flWindSpeed; // 0x40	
	Vector m_currentWindVector; // 0x44	
	Vector m_CurrentSwayVector; // 0x50	
	Vector m_PrevSwayVector; // 0x5c	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "9"
	uint16_t m_iInitialWindDir; // 0x68	
private:
	[[maybe_unused]] uint8_t __pad006a[0x2]; // 0x6a
public:
	// MNetworkEnable
	// MNetworkEnable
	float m_flInitialWindSpeed; // 0x6c	
	float m_flVariationTime; // 0x70	
	float m_flSwayTime; // 0x74	
	float m_flSimTime; // 0x78	
	float m_flSwitchTime; // 0x7c	
	float m_flAveWindSpeed; // 0x80	
	bool m_bGusting; // 0x84	
private:
	[[maybe_unused]] uint8_t __pad0085[0x3]; // 0x85
public:
	float m_flWindAngleVariation; // 0x88	
	float m_flWindSpeedVariation; // 0x8c	
	CEntityIndex m_iEntIndex; // 0x90	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x8
// Has VTable
// Is Abstract
class C_GameRules
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// No schema binary for binding
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x30
// Has VTable
class C_CHintMessageQueue
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	float m_tmMessageEnd; // 0x8	
private:
	[[maybe_unused]] uint8_t __pad000c[0x4]; // 0xc
public:
	CUtlVector< CHintMessage* > m_messages; // 0x10	
	C_BasePlayer* m_pPlayer; // 0x28	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x20
// Has VTable
class C_MultiplayRules : public C_GameRules
{
private:
	[[maybe_unused]] uint8_t __pad0008[0x10]; // 0x8
public:
	// No schema binary for binding
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x40
// Has VTable
// Has Trivial Destructor
// 
// MNetworkVarNames "CHandle< CFogController> m_hCtrl"
struct C_fogplayerparams_t
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "PlayerFogController"
	CHandle< C_FogController > m_hCtrl; // 0x8	
	float m_flTransitionTime; // 0xc	
	Color m_OldColor; // 0x10	
	float m_flOldStart; // 0x14	
	float m_flOldEnd; // 0x18	
	float m_flOldMaxDensity; // 0x1c	
	float m_flOldHDRColorScale; // 0x20	
	float m_flOldFarZ; // 0x24	
	Color m_NewColor; // 0x28	
	float m_flNewStart; // 0x2c	
	float m_flNewEnd; // 0x30	
	float m_flNewMaxDensity; // 0x34	
	float m_flNewHDRColorScale; // 0x38	
	float m_flNewFarZ; // 0x3c	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x28
class C_CSequenceTransitioner
{
public:
	CUtlVector< CAnimationLayer > m_animationQueue; // 0x0	
	bool m_bIsInSimulation; // 0x18	
private:
	[[maybe_unused]] uint8_t __pad0019[0x3]; // 0x19
public:
	float m_flSimOrRenderTime; // 0x1c	
	float m_flInterpolatedTime; // 0x20	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x238
// Has VTable
class C_CSequenceTransitioner2
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	CNetworkedSequenceOperation m_currentOp; // 0x8	
	float m_flCurrentPlaybackRate; // 0x48	
	float m_flCurrentAnimTime; // 0x4c	
	TransitioningLayer_t m_transitioningLayers[4]; // 0x50	
	C_BaseAnimatingController* m_pOwner; // 0x1d0	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x8
// Has VTable
class C_SingleplayRules : public C_GameRules
{
public:
	// No schema binary for binding
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x18
// Has VTable
// 
// MNetworkVarNames "attrib_definition_index_t m_iAttributeDefinitionIndex"
// MNetworkVarNames "float m_flValue"
class C_EconItemAttribute
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x12]; // 0x0
public:
	// MNetworkEnable
	// MNetworkEnable
	uint16_t m_iAttributeDefinitionIndex; // 0x12	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkAlias "m_iRawValue32"
	float m_flValue; // 0x14	
};

// Registered binary: client.dll (project 'client')
// Alignment: 4
// Size: 0xc
// Has Trivial Destructor
struct C_EconEntity__AttachedParticleInfo_t
{
public:
	ParticleIndex_t m_nAttachedParticleIndex; // 0x0	
	CUtlStringToken m_customType; // 0x4	
	bool m_bShouldDestroyImmediately; // 0x8	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x10
// Has Trivial Constructor
// Has Trivial Destructor
struct C_EconEntity__AttachedModelData_t
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	int32_t m_iModelDisplayFlags; // 0x8	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x558
// Has VTable
class CGlobalLightBase
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x10]; // 0x0
public:
	bool m_bSpotLight; // 0x10	
private:
	[[maybe_unused]] uint8_t __pad0011[0x3]; // 0x11
public:
	Vector m_SpotLightOrigin; // 0x14	
	QAngle m_SpotLightAngles; // 0x20	
	Vector m_ShadowDirection; // 0x2c	
	Vector m_AmbientDirection; // 0x38	
	Vector m_SpecularDirection; // 0x44	
	Vector m_InspectorSpecularDirection; // 0x50	
	float m_flSpecularPower; // 0x5c	
	float m_flSpecularIndependence; // 0x60	
	Color m_SpecularColor; // 0x64	
	bool m_bStartDisabled; // 0x68	
	bool m_bEnabled; // 0x69	
	Color m_LightColor; // 0x6a	
	Color m_HeroLightColor; // 0x6e	
	Color m_AOGradientBottomColor; // 0x72	
	bool m_bEnableRainFx; // 0x76	
	Color m_AmbientColor1; // 0x77	
	Color m_AmbientColor2; // 0x7b	
	Color m_AmbientColor3; // 0x7f	
private:
	[[maybe_unused]] uint8_t __pad0083[0x1]; // 0x83
public:
	float m_flSunDistance; // 0x84	
	float m_flFOV; // 0x88	
	float m_flNearZ; // 0x8c	
	float m_flFarZ; // 0x90	
	bool m_bEnableShadows; // 0x94	
	bool m_bOldEnableShadows; // 0x95	
	bool m_bBackgroundClearNotRequired; // 0x96	
private:
	[[maybe_unused]] uint8_t __pad0097[0x1]; // 0x97
public:
	float m_flCloudScale; // 0x98	
	float m_flCloud1Speed; // 0x9c	
	float m_flCloud1Direction; // 0xa0	
	float m_flCloud2Speed; // 0xa4	
	float m_flCloud2Direction; // 0xa8	
	float m_flAmbientScale1; // 0xac	
	float m_flAmbientScale2; // 0xb0	
	float m_flGroundScale; // 0xb4	
	float m_flLightScale; // 0xb8	
	float m_flHeroLightScale; // 0xbc	
	float m_flRainInnerRadius; // 0xc0	
	float m_flRainOuterRadius; // 0xc4	
	float m_flRainInnerAmount; // 0xc8	
	float m_flFoWDarkness; // 0xcc	
	bool m_bEnableSeparateSkyboxFog; // 0xd0	
private:
	[[maybe_unused]] uint8_t __pad00d1[0x3]; // 0xd1
public:
	Vector m_vFowColor; // 0xd4	
	Vector m_ViewOrigin; // 0xe0	
	QAngle m_ViewAngles; // 0xec	
	float m_flViewFoV; // 0xf8	
	Vector m_WorldPoints[8]; // 0xfc	
private:
	[[maybe_unused]] uint8_t __pad015c[0x38c]; // 0x15c
public:
	Vector2D m_vFogOffsetLayer0; // 0x4e8	
	Vector2D m_vFogOffsetLayer1; // 0x4f0	
	CHandle< C_BaseEntity > m_hEnvWind; // 0x4f8	
	CHandle< C_BaseEntity > m_hEnvSky; // 0x4fc	
	float m_fSmoothedAmount; // 0x500	
	float m_fSlowSmoothedAmount; // 0x504	
	
	// Datamap fields:
	// float m_flAmbientShadowAmount; // 0x4e4
};

// Registered binary: client.dll (project 'client')
// Alignment: 16
// Size: 0x190
// Has VTable
// 
// MNetworkVarNames "Color m_LightColor"
// MNetworkVarNames "float m_flIntensity"
// MNetworkVarNames "float m_flLightSize"
// MNetworkVarNames "float m_flSpotFoV"
// MNetworkVarNames "QAngle m_vLightDirection"
// MNetworkVarNames "float m_flStartFalloff"
// MNetworkVarNames "float m_flDistanceFalloff"
// MNetworkVarNames "uint m_nFlags"
// MNetworkVarNames "char m_ProjectedTextureName"
class CDeferredLightBase
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x10]; // 0x0
public:
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "32"
	Color m_LightColor; // 0x10	
	// MNetworkEnable
	// MNetworkEnable
	float m_flIntensity; // 0x14	
	// MNetworkEnable
	// MNetworkEnable
	float m_flLightSize; // 0x18	
	// MNetworkEnable
	// MNetworkEnable
	float m_flSpotFoV; // 0x1c	
	// MNetworkEnable
	// MNetworkEnable
	QAngle m_vLightDirection; // 0x20	
	// MNetworkEnable
	// MNetworkEnable
	float m_flStartFalloff; // 0x2c	
	// MNetworkEnable
	// MNetworkEnable
	float m_flDistanceFalloff; // 0x30	
	// MNetworkEnable
	// MNetworkEnable
	uint32_t m_nFlags; // 0x34	
	// MNetworkEnable
	// MNetworkEnable
	char m_ProjectedTextureName[260]; // 0x38	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x3f8
// Has VTable
class CLightInfoBase
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x10]; // 0x0
public:
	Vector2D m_origin2D; // 0x10	
	Color m_Color[2]; // 0x18	
	float m_LightScale[2]; // 0x20	
	Color m_HeroColor[2]; // 0x28	
	float m_HeroLightScale[2]; // 0x30	
	Color m_AOGradientBottomColor[2]; // 0x38	
	bool m_bEnableRainFx; // 0x40	
private:
	[[maybe_unused]] uint8_t __pad0041[0x3]; // 0x41
public:
	float m_flRainInnerRadius; // 0x44	
	float m_flRainOuterRadius; // 0x48	
	float m_flRainInnerAmount; // 0x4c	
	Color m_AmbientColor[2]; // 0x50	
	float m_AmbientScale[2]; // 0x58	
	Color m_ShadowColor[2]; // 0x60	
	Color m_ShadowSecondaryColor[2]; // 0x68	
	float m_ShadowScale[2]; // 0x70	
	float m_ShadowGroundScale[2]; // 0x78	
	Color m_SpecularColor[2]; // 0x80	
	float m_flSpecularPower[2]; // 0x88	
	float m_flSpecularIndependence[2]; // 0x90	
	Vector m_SpecularDirection[2]; // 0x98	
	Vector m_InspectorSpecularDirection[2]; // 0xb0	
	Vector m_LightDirection[2]; // 0xc8	
	Vector m_AmbientDirection[2]; // 0xe0	
	Color m_FogColor[2]; // 0xf8	
	float m_FogStart[2]; // 0x100	
	float m_FogEnd[2]; // 0x108	
	float m_HeightFogValue[2]; // 0x110	
	Color m_HeightFogColor[2]; // 0x118	
	float m_FoWDarkness[2]; // 0x120	
	float m_FoWColorR[2]; // 0x128	
	float m_FoWColorG[2]; // 0x130	
	float m_FoWColorB[2]; // 0x138	
	Color m_InspectorViewFogColor[2]; // 0x140	
	QAngle m_windAngle; // 0x148	
	float m_flWindAmount[2]; // 0x154	
	float m_flMinWind; // 0x15c	
	float m_flMaxWind; // 0x160	
	float m_flMinGust; // 0x164	
	float m_flMaxGust; // 0x168	
	float m_flMinGustDelay; // 0x16c	
	float m_flMaxGustDelay; // 0x170	
	float m_flGustDuration; // 0x174	
	float m_flGustDirChange; // 0x178	
	QAngle m_skyboxAngle[2]; // 0x17c	
private:
	[[maybe_unused]] uint8_t __pad0194[0x4]; // 0x194
public:
	CStrongHandle< InfoForResourceTypeIMaterial2 > m_hSkyboxMaterial[2]; // 0x198	
	Color m_vSkyboxTintColor[2]; // 0x1a8	
	uint8_t m_nSkyboxFogType; // 0x1b0	
private:
	[[maybe_unused]] uint8_t __pad01b1[0x3]; // 0x1b1
public:
	float m_flSkyboxAngularFogMaxEnd; // 0x1b4	
	float m_flSkyboxAngularFogMaxStart; // 0x1b8	
	float m_flSkyboxAngularFogMinStart; // 0x1bc	
	float m_flSkyboxAngularFogMinEnd; // 0x1c0	
	Vector4D m_vAngularParams; // 0x1c4	
	Color m_vHeightFogColor[2]; // 0x1d4	
	float m_flFogMaxZ; // 0x1dc	
	float m_flFogDensity[2]; // 0x1e0	
	float m_flFogFalloff; // 0x1e8	
private:
	[[maybe_unused]] uint8_t __pad01ec[0x4]; // 0x1ec
public:
	CStrongHandle< InfoForResourceTypeCTextureBase > m_hFogTexture0; // 0x1f0	
	float m_flFogLayer0Rotation; // 0x1f8	
	float m_flFogLayer0Scale; // 0x1fc	
	float m_flFoglayer0ScrollU[2]; // 0x200	
	float m_flFoglayer0ScrollV[2]; // 0x208	
	CStrongHandle< InfoForResourceTypeCTextureBase > m_hFogTexture1; // 0x210	
	float m_flFogLayer1Rotation; // 0x218	
	float m_flFogLayer1Scale; // 0x21c	
	float m_flFoglayer1ScrollU[2]; // 0x220	
	float m_flFoglayer1ScrollV[2]; // 0x228	
	CStrongHandle< InfoForResourceTypeCTextureBase > m_hFogTextureOpacity; // 0x230	
	CStrongHandle< InfoForResourceTypeCTextureBase > m_hWaterFlowMapTexture; // 0x238	
	CStrongHandle< InfoForResourceTypeCTextureBase > m_hFogFlowMapTexture; // 0x240	
	float m_flFogExclusionInnerRadius; // 0x248	
	float m_flFogExclusionHeightBias; // 0x24c	
private:
	[[maybe_unused]] uint8_t __pad0250[0x4]; // 0x250
public:
	float m_flCausticSpeedScale; // 0x254	
	float m_flCausticAmplitudeScale; // 0x258	
private:
	[[maybe_unused]] uint8_t __pad025c[0x4]; // 0x25c
public:
	CStrongHandle< InfoForResourceTypeCTextureBase > m_hColorWarp; // 0x260	
	float m_flColorWarpBlendToFull; // 0x268	
	float m_fInnerRadius; // 0x26c	
	float m_fOuterRadius; // 0x270	
	float m_flLightning_specular_pow_scale_min; // 0x274	
	float m_flLightning_specular_pow_scale_max; // 0x278	
	Color m_lightningColor; // 0x27c	
	float m_flLightningIntensityMin; // 0x280	
	float m_flLightningIntensityMax; // 0x284	
	float m_flLightningElevation; // 0x288	
	float m_flLightningSpecularIntensity; // 0x28c	
	float m_flFarZOverride; // 0x290	
	float m_flAmbientShadowAmount; // 0x294	
	int32_t m_nWeatherType; // 0x298	
private:
	[[maybe_unused]] uint8_t __pad029c[0x4]; // 0x29c
public:
	CUtlString m_WeatherEffect; // 0x2a0	
	float m_flLightning_period_min; // 0x2a8	
	float m_flLightning_period_max; // 0x2ac	
	float m_flLightning_duration_min; // 0x2b0	
	float m_flLightning_duration_max; // 0x2b4	
	float m_flLightning_fluctuation_min; // 0x2b8	
	float m_flLightning_fluctuation_max; // 0x2bc	
	char m_pszLightningSound[260]; // 0x2c0	
	float m_flNextLightningStartTime; // 0x3c4	
	float m_flNextLightningEndTime; // 0x3c8	
	float m_flLightningFluctuationTimeStart; // 0x3cc	
	float m_flLightningFluctuationTimeEnd; // 0x3d0	
	float m_flLightningNumFluctuations; // 0x3d4	
	float m_flNextLightningSoundTime; // 0x3d8	
	bool m_bPlayLightingSound; // 0x3dc	
private:
	[[maybe_unused]] uint8_t __pad03dd[0x3]; // 0x3dd
public:
	float m_flLightningEventMagnitude; // 0x3e0	
	float m_flLightningScale; // 0x3e4	
	float m_flLightningFluctuation; // 0x3e8	
	float m_flLightningAngle; // 0x3ec	
	float m_flLightningEventPercentage; // 0x3f0	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x18
struct GCConsumedIDs_t
{
public:
	CUtlVector< item_definition_index_t > m_vecIDs; // 0x0	
};

// Registered binary: client.dll (project 'entity2')
// Alignment: 8
// Size: 0x38
// Has VTable
// 
// MNetworkVarNames "CEntityIdentity * m_pEntity"
// MNetworkVarNames "CScriptComponent::Storage_t m_CScriptComponent"
class CEntityInstance : public IHandleEntity
{
public:
	// MNetworkDisable
	CUtlSymbolLarge m_iszPrivateVScripts; // 0x8	
	// MNetworkEnable
	// MNetworkPriority "112"
	CEntityIdentity* m_pEntity; // 0x10	
private:
	[[maybe_unused]] uint8_t __pad0018[0x8]; // 0x18
public:
	// MNetworkDisable
	CUtlStringToken m_worldGroupId; // 0x20	
private:
	[[maybe_unused]] uint8_t __pad0024[0xc]; // 0x24
public:
	// MNetworkEnable
	// MNetworkDisable
	CScriptComponent* m_CScriptComponent; // 0x30	
};

// Registered binary: client.dll (project 'entity2')
// Alignment: 8
// Size: 0x38
// Has VTable
class CScriptComponent : public CEntityComponent
{
private:
	[[maybe_unused]] uint8_t __pad0008[0x28]; // 0x8
public:
	CUtlSymbolLarge m_scriptClassName; // 0x30	
	
	// Static fields:
	static EntComponentInfo_t &Get_s_EntComponentInfo(){return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CScriptComponent")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CScriptComponent")->m_static_fields[1]->m_instance);};
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x38
// Has VTable
// Is Abstract
class C_GameEntity : public CEntityInstance
{
public:
	// No schema binary for binding
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x450
// Has VTable
// 
// MNetworkOverride "m_baseLayer.m_hSequence"
// MNetworkVarNames "CNetworkedSequenceOperation m_baseLayer"
// MNetworkVarNames "float m_flPoseParameter"
// MNetworkVarNames "bool m_bClientSideAnimation"
// MNetworkVarNames "int m_nNewSequenceParity"
// MNetworkVarNames "int m_nResetEventsParity"
class C_BaseAnimatingController : public CSkeletonAnimationController
{
private:
	[[maybe_unused]] uint8_t __pad0010[0x8]; // 0x10
public:
	// MNetworkEnable
	// MNetworkChangeCallback "baseAnimBaseLayerChanged"
	CNetworkedSequenceOperation m_baseLayer; // 0x18	
	// MNetworkDisable
	bool m_bSequenceFinished; // 0x58	
private:
	[[maybe_unused]] uint8_t __pad0059[0x3]; // 0x59
public:
	// MNetworkDisable
	float m_flGroundSpeed; // 0x5c	
	// MNetworkDisable
	float m_flLastEventCycle; // 0x60	
	// MNetworkDisable
	float m_flLastEventAnimTime; // 0x64	
	// MNetworkEnable
	// MNetworkBitCount "8"
	// MNetworkMinValue "-4.000000"
	// MNetworkMaxValue "12.000000"
	// MNetworkEncodeFlags "5"
	// MNetworkPriority "64"
	// MNetworkChangeCallback "playbackRateChanged"
	CNetworkedQuantizedFloat m_flPlaybackRate; // 0x68	
	// MNetworkDisable
	float m_flPrevAnimTime; // 0x80	
	// MNetworkEnable
	// MNetworkBitCount "11"
	// MNetworkMinValue "0.000000"
	// MNetworkMaxValue "1.000000"
	// MNetworkUserGroup "m_flPoseParameter"
	// MNetworkChangeCallback "poseParametersChanged"
	float m_flPoseParameter[24]; // 0x84	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkChangeCallback "clientSideAnimationChanged"
	bool m_bClientSideAnimation; // 0xe4	
	// MNetworkDisable
	bool m_bNetworkedAnimationInputsChanged; // 0xe5	
	// MNetworkDisable
	uint8_t m_nPrevNewSequenceParity; // 0xe6	
	// MNetworkDisable
	uint8_t m_nPrevResetEventsParity; // 0xe7	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "3"
	// MNetworkPriority "64"
	// MNetworkChangeCallback "clientSideAnimCycleReset"
	int32_t m_nNewSequenceParity; // 0xe8	
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkBitCount "3"
	// MNetworkPriority "64"
	int32_t m_nResetEventsParity; // 0xec	
	// MNetworkDisable
	float m_flIKGroundContactTime; // 0xf0	
	// MNetworkDisable
	float m_flIKGroundMinHeight; // 0xf4	
	// MNetworkDisable
	float m_flIKGroundMaxHeight; // 0xf8	
	// MNetworkDisable
	float m_flIkZAdjustAmount; // 0xfc	
private:
	[[maybe_unused]] uint8_t __pad0100[0x28]; // 0x100
public:
	// MNetworkDisable
	// -> m_currentOp - 0x130
	// -> m_flCurrentPlaybackRate - 0x170
	// -> m_flCurrentAnimTime - 0x174
	// -> m_transitioningLayers[4] - 0x178
	// -> m_pOwner - 0x2f8
	C_CSequenceTransitioner2 m_SequenceTransitioner; // 0x128	
private:
	[[maybe_unused]] uint8_t __pad0360[0x40]; // 0x360
public:
	// MNetworkDisable
	HSequence m_hLastAnimEventSequence; // 0x3a0	
	// MNetworkDisable
	uint32_t m_ClientSideAnimationListHandle; // 0x3a4	
	
	// Datamap fields:
	// void m_pAnimGraphInstance; // 0x360
	// float m_flCachedSequenceCycleRate; // 0x118
	// float m_flCachedGroundSpeed; // 0x11c
	// float m_flCachedOneMinusLastVisibleCycle; // 0x120
	// bool m_bModelHasNoPoseParams; // 0x124
	// bool m_bNotifyWhenSequenceFinished; // 0x125
	// void m_iv_AnimOpHistory; // 0x3a8
	// void m_iv_flPoseParameter; // 0x3f8
	// bool useClientSideAnimation; // 0x7fffffff
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x4b8
// Has VTable
// 
// MNetworkVarNames "CAnimationLayer m_AnimOverlay"
class C_BaseAnimatingOverlayController : public C_BaseAnimatingController
{
public:
	// MNetworkEnable
	// MNetworkEnable
	// MNetworkUserGroup "overlay_vars"
	// MNetworkChangeCallback "OnOverlaysChanged2"
	CUtlVector< CAnimationLayer > m_AnimOverlay; // 0x450	
	
	// Datamap fields:
	// void m_iv_AnimOverlay; // 0x498
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x40
// Has VTable
class CBodyComponent : public CEntityComponent
{
public:
	// MNetworkDisable
	CGameSceneNode* m_pSceneNode; // 0x8	
private:
	[[maybe_unused]] uint8_t __pad0010[0x10]; // 0x10
public:
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; // 0x20	
	
	// Static fields:
	static EntComponentInfo_t &Get_s_EntComponentInfo(){return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponent")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponent")->m_static_fields[1]->m_instance);};
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x1c0
// Has VTable
// 
// MNetworkVarNames "CGameSceneNode m_sceneNode"
class CBodyComponentPoint : public CBodyComponent
{
public:
	// MNetworkEnable
	CGameSceneNode m_sceneNode; // 0x40	
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; // 0x1a0	
	
	// Static fields:
	static EntComponentInfo_t &Get_s_EntComponentInfo(){return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponentPoint")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponentPoint")->m_static_fields[1]->m_instance);};
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x520
// Has VTable
// 
// MNetworkVarNames "CSkeletonInstance m_skeletonInstance"
class CBodyComponentSkeletonInstance : public CBodyComponent
{
public:
	// MNetworkEnable
	CSkeletonInstance m_skeletonInstance; // 0x40	
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; // 0x500	
	
	// Static fields:
	static EntComponentInfo_t &Get_s_EntComponentInfo(){return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponentSkeletonInstance")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CBodyComponentSkeletonInstance")->m_static_fields[1]->m_instance);};
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x18
// Has VTable
class CHitboxComponent : public CEntityComponent
{
private:
	[[maybe_unused]] uint8_t __pad0008[0x8]; // 0x8
public:
	// Static fields:
	static EntComponentInfo_t &Get_s_EntComponentInfo(){return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CHitboxComponent")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_referenced_but_impl_is_contained(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CHitboxComponent")->m_static_fields[1]->m_instance);};
	// No schema binary for binding
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x190
// Has VTable
// 
// MNetworkVarNames "Color m_Color"
// MNetworkVarNames "float m_flBrightness"
// MNetworkVarNames "float m_flBrightnessMult"
// MNetworkVarNames "float m_flRange"
// MNetworkVarNames "float m_flFalloff"
// MNetworkVarNames "float m_flAttenuation0"
// MNetworkVarNames "float m_flAttenuation1"
// MNetworkVarNames "float m_flAttenuation2"
// MNetworkVarNames "float m_flTheta"
// MNetworkVarNames "float m_flPhi"
// MNetworkVarNames "CUtlStringToken m_lightCookie"
// MNetworkVarNames "int m_nCascades"
// MNetworkVarNames "int m_nCastShadows"
// MNetworkVarNames "int m_nShadowWidth"
// MNetworkVarNames "int m_nShadowHeight"
// MNetworkVarNames "bool m_bRenderDiffuse"
// MNetworkVarNames "int m_nRenderSpecular"
// MNetworkVarNames "bool m_bRenderTransmissive"
// MNetworkVarNames "float m_flOrthoLightWidth"
// MNetworkVarNames "float m_flOrthoLightHeight"
// MNetworkVarNames "int m_nStyle"
// MNetworkVarNames "CUtlString m_Pattern"
// MNetworkVarNames "float m_flShadowCascadeDistance0"
// MNetworkVarNames "float m_flShadowCascadeDistance1"
// MNetworkVarNames "float m_flShadowCascadeDistance2"
// MNetworkVarNames "float m_flShadowCascadeDistance3"
// MNetworkVarNames "int m_nShadowCascadeResolution0"
// MNetworkVarNames "int m_nShadowCascadeResolution1"
// MNetworkVarNames "int m_nShadowCascadeResolution2"
// MNetworkVarNames "int m_nShadowCascadeResolution3"
// MNetworkVarNames "int m_nBakeLightIndex"
// MNetworkVarNames "float m_flBakeLightIndexScale"
// MNetworkVarNames "bool m_bUsesIndexedBakedLighting"
// MNetworkVarNames "bool m_bRenderToCubemaps"
// MNetworkVarNames "int m_nPriority"
// MNetworkVarNames "string_t m_LightGroups"
// MNetworkVarNames "int m_nDirectLight"
// MNetworkVarNames "int m_nIndirectLight"
// MNetworkVarNames "float m_flFadeMinDist"
// MNetworkVarNames "float m_flFadeMaxDist"
// MNetworkVarNames "float m_flShadowFadeMinDist"
// MNetworkVarNames "float m_flShadowFadeMaxDist"
// MNetworkVarNames "bool m_bEnabled"
// MNetworkVarNames "bool m_bFlicker"
// MNetworkVarNames "Vector m_vPrecomputedBoundsMins"
// MNetworkVarNames "Vector m_vPrecomputedBoundsMaxs"
// MNetworkVarNames "float m_flPrecomputedMaxRange"
// MNetworkVarNames "Vector m_vPrecomputePosition"
// MNetworkVarNames "Vector m_vPrecomputeDirection"
// MNetworkVarNames "Vector m_vPrecomputeUp"
// MNetworkVarNames "int m_nFogLightingMode"
// MNetworkVarNames "float m_flFogContributionStength"
// MNetworkVarNames "float m_flNearClipPlane"
// MNetworkVarNames "Color m_SkyColor"
// MNetworkVarNames "float m_flSkyIntensity"
// MNetworkVarNames "bool m_bLowerHemisphereIsBlack"
// MNetworkVarNames "Color m_SkyAmbientBounce"
// MNetworkVarNames "bool m_bMixedShadows"
// MNetworkVarNames "float m_flLightStyleStartTime"
class CLightComponent : public CEntityComponent
{
private:
	[[maybe_unused]] uint8_t __pad0008[0x40]; // 0x8
public:
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; // 0x48	
private:
	[[maybe_unused]] uint8_t __pad0060[0x15]; // 0x60
public:
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	Color m_Color; // 0x75	
private:
	[[maybe_unused]] uint8_t __pad0079[0x3]; // 0x79
public:
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flBrightness; // 0x7c	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flBrightnessMult; // 0x80	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRangeChanged"
	float m_flRange; // 0x84	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flFalloff; // 0x88	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flAttenuation0; // 0x8c	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flAttenuation1; // 0x90	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flAttenuation2; // 0x94	
	// MNetworkEnable
	// MNetworkChangeCallback "LightShapeChanged"
	float m_flTheta; // 0x98	
	// MNetworkEnable
	// MNetworkChangeCallback "LightShapeChanged"
	float m_flPhi; // 0x9c	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	CUtlStringToken m_lightCookie; // 0xa0	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nCascades; // 0xa4	
	// MNetworkEnable
	// MNetworkChangeCallback "LightShapeChanged"
	int32_t m_nCastShadows; // 0xa8	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowWidth; // 0xac	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowHeight; // 0xb0	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bRenderDiffuse; // 0xb4	
private:
	[[maybe_unused]] uint8_t __pad00b5[0x3]; // 0xb5
public:
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nRenderSpecular; // 0xb8	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bRenderTransmissive; // 0xbc	
private:
	[[maybe_unused]] uint8_t __pad00bd[0x3]; // 0xbd
public:
	// MNetworkEnable
	// MNetworkChangeCallback "LightShapeChanged"
	float m_flOrthoLightWidth; // 0xc0	
	// MNetworkEnable
	// MNetworkChangeCallback "LightShapeChanged"
	float m_flOrthoLightHeight; // 0xc4	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nStyle; // 0xc8	
private:
	[[maybe_unused]] uint8_t __pad00cc[0x4]; // 0xcc
public:
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	CUtlString m_Pattern; // 0xd0	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeDistance0; // 0xd8	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeDistance1; // 0xdc	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeDistance2; // 0xe0	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowCascadeDistance3; // 0xe4	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowCascadeResolution0; // 0xe8	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowCascadeResolution1; // 0xec	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowCascadeResolution2; // 0xf0	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nShadowCascadeResolution3; // 0xf4	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nBakeLightIndex; // 0xf8	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flBakeLightIndexScale; // 0xfc	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bUsesIndexedBakedLighting; // 0x100	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bRenderToCubemaps; // 0x101	
private:
	[[maybe_unused]] uint8_t __pad0102[0x2]; // 0x102
public:
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	int32_t m_nPriority; // 0x104	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	CUtlSymbolLarge m_LightGroups; // 0x108	
	// MNetworkEnable
	int32_t m_nDirectLight; // 0x110	
	// MNetworkEnable
	int32_t m_nIndirectLight; // 0x114	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flFadeMinDist; // 0x118	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flFadeMaxDist; // 0x11c	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowFadeMinDist; // 0x120	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flShadowFadeMaxDist; // 0x124	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bEnabled; // 0x128	
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	bool m_bFlicker; // 0x129	
private:
	[[maybe_unused]] uint8_t __pad012a[0x2]; // 0x12a
public:
	// MNetworkEnable
	Vector m_vPrecomputedBoundsMins; // 0x12c	
	// MNetworkEnable
	Vector m_vPrecomputedBoundsMaxs; // 0x138	
	// MNetworkEnable
	float m_flPrecomputedMaxRange; // 0x144	
	// MNetworkEnable
	Vector m_vPrecomputePosition; // 0x148	
	// MNetworkEnable
	Vector m_vPrecomputeDirection; // 0x154	
	// MNetworkEnable
	Vector m_vPrecomputeUp; // 0x160	
	// MNetworkEnable
	int32_t m_nFogLightingMode; // 0x16c	
	// MNetworkEnable
	float m_flFogContributionStength; // 0x170	
	// MNetworkEnable
	float m_flNearClipPlane; // 0x174	
	// MNetworkEnable
	Color m_SkyColor; // 0x178	
	// MNetworkEnable
	float m_flSkyIntensity; // 0x17c	
	// MNetworkEnable
	bool m_bLowerHemisphereIsBlack; // 0x180	
	// MNetworkEnable
	Color m_SkyAmbientBounce; // 0x181	
	// MNetworkEnable
	// MNetworkChangeCallback "MixedShadowsChanged"
	bool m_bMixedShadows; // 0x185	
private:
	[[maybe_unused]] uint8_t __pad0186[0x2]; // 0x186
public:
	// MNetworkEnable
	// MNetworkChangeCallback "LightRenderingChanged"
	float m_flLightStyleStartTime; // 0x188	
	
	// Static fields:
	static EntComponentInfo_t &Get_s_EntComponentInfo(){return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CLightComponent")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_contained_but_impl_is_referenced(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CLightComponent")->m_static_fields[1]->m_instance);};
	
	// Datamap fields:
	// bool m_bShapeChanged; // 0x74
	// SHIM m_bRenderSpecular; // 0xb8
	// SHIM m_bCastShadows; // 0xa8
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0xa8
// Has VTable
class CRenderComponent : public CEntityComponent
{
private:
	[[maybe_unused]] uint8_t __pad0008[0x8]; // 0x8
public:
	// MNetworkDisable
	// MNetworkChangeAccessorFieldPathIndex
	CNetworkVarChainer __m_pChainEntity; // 0x10	
private:
	[[maybe_unused]] uint8_t __pad0028[0x18]; // 0x28
public:
	bool m_bIsRenderingWithViewModels; // 0x40	
private:
	[[maybe_unused]] uint8_t __pad0041[0x3]; // 0x41
public:
	uint32_t m_nSplitscreenFlags; // 0x44	
private:
	[[maybe_unused]] uint8_t __pad0048[0x8]; // 0x48
public:
	bool m_bEnableRendering; // 0x50	
private:
	[[maybe_unused]] uint8_t __pad0051[0x4f]; // 0x51
public:
	bool m_bInterpolationReadyToDraw; // 0xa0	
	
	// Static fields:
	static EntComponentInfo_t &Get_s_EntComponentInfo(){return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CRenderComponent")->m_static_fields[0]->m_instance);};
