#pragma once
#include <cstdint>
#include "!GlobalTypes.hpp"

// /////////////////////////////////////////////////////////////
// Binary: server.dll
// Classes count: 6,586 (Allocated) | 6,656 (Unallocated)
// Enums count: 3 (Allocated) | 36 (Unallocated)
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

// Registered binary: server.dll (project 'server')
// Enumerator count: 3
// Alignment: 4
// Size: 0x4
enum class CDOTA_BaseNPC_AghsFort_Watch_Tower__ExitDirection_t : std::uint32_t
{
	EXIT_DIRECTION_LEFT = 0x0,
	EXIT_DIRECTION_TOP = 0x1,
	EXIT_DIRECTION_RIGHT = 0x2,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 4
// Alignment: 4
// Size: 0x4
enum class CLogicBranchList__LogicBranchListenerLastState_t : std::uint32_t
{
	LOGIC_BRANCH_LISTENER_NOT_INIT = 0x0,
	LOGIC_BRANCH_LISTENER_ALL_TRUE = 0x1,
	LOGIC_BRANCH_LISTENER_ALL_FALSE = 0x2,
	LOGIC_BRANCH_LISTENER_MIXED = 0x3,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 3
// Alignment: 4
// Size: 0x4
enum class CFuncMover__Move_t : std::uint32_t
{
	MOVE_LOOP = 0x0,
	MOVE_OSCILLATE = 0x1,
	MOVE_STOP_AT_END = 0x2,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 31
// Alignment: 4
// Size: 0x4
enum class ELanguage : std::uint32_t
{
	k_Lang_None = 0xffffffff,
	k_Lang_First = 0x0,
	k_Lang_English = 0x0,
	k_Lang_German = 0x1,
	k_Lang_French = 0x2,
	k_Lang_Italian = 0x3,
	k_Lang_Korean = 0x4,
	k_Lang_Spanish = 0x5,
	k_Lang_Simplified_Chinese = 0x6,
	k_Lang_Traditional_Chinese = 0x7,
	k_Lang_Russian = 0x8,
	k_Lang_Thai = 0x9,
	k_Lang_Japanese = 0xa,
	k_Lang_Portuguese = 0xb,
	k_Lang_Polish = 0xc,
	k_Lang_Danish = 0xd,
	k_Lang_Dutch = 0xe,
	k_Lang_Finnish = 0xf,
	k_Lang_Norwegian = 0x10,
	k_Lang_Swedish = 0x11,
	k_Lang_Hungarian = 0x12,
	k_Lang_Czech = 0x13,
	k_Lang_Romanian = 0x14,
	k_Lang_Turkish = 0x15,
	k_Lang_Brazilian = 0x16,
	k_Lang_Bulgarian = 0x17,
	k_Lang_Greek = 0x18,
	k_Lang_Ukrainian = 0x19,
	k_Lang_Latam_Spanish = 0x1a,
	k_Lang_Vietnamese = 0x1b,
	k_Lang_MAX = 0x1c,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 2
// Alignment: 4
// Size: 0x4
enum class SceneOnPlayerDeath_t : std::uint32_t
{
	SCENE_ONPLAYERDEATH_DO_NOTHING = 0x0,
	SCENE_ONPLAYERDEATH_CANCEL = 0x1,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 3
// Alignment: 4
// Size: 0x4
enum class LessonPanelLayoutFileTypes_t : std::uint32_t
{
	LAYOUT_HAND_DEFAULT = 0x0,
	LAYOUT_WORLD_DEFAULT = 0x1,
	LAYOUT_CUSTOM = 0x2,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 3
// Alignment: 4
// Size: 0x4
enum class Explosions : std::uint32_t
{
	expRandom = 0x0,
	expDirected = 0x1,
	expUsePrecise = 0x2,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 4
// Alignment: 4
// Size: 0x4
enum class TrainOrientationType_t : std::uint32_t
{
	TrainOrientation_Fixed = 0x0,
	TrainOrientation_AtPathTracks = 0x1,
	TrainOrientation_LinearBlend = 0x2,
	TrainOrientation_EaseInEaseOut = 0x3,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 12
// Alignment: 2
// Size: 0x2
enum class SoundTypes_t : std::uint16_t
{
	SOUND_NONE = 0x0,
	SOUND_COMBAT = 0x1,
	SOUND_PLAYER = 0x2,
	SOUND_DANGER = 0x3,
	SOUND_BULLET_IMPACT = 0x4,
	SOUND_THUMPER = 0x5,
	SOUND_PHYSICS_DANGER = 0x6,
	SOUND_MOVE_AWAY = 0x7,
	SOUND_PLAYER_VEHICLE = 0x8,
	SOUND_GLASS_BREAK = 0x9,
	SOUND_PHYSICS_OBJECT = 0xa,
	NUM_AI_SOUND_TYPES = 0xb,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 3
// Alignment: 4
// Size: 0x4
enum class CreatureAbilityType : std::uint32_t
{
	CREATURE_ABILITY_OFFENSIVE = 0x0,
	CREATURE_ABILITY_DEFENSIVE = 0x1,
	CREATURE_ABILITY_ESCAPE = 0x2,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 5
// Alignment: 4
// Size: 0x4
enum class CHeadLookParams__HeadLookPriority_t : std::uint32_t
{
	BORING = 0x0,
	INTERESTING = 0x1,
	IMPORTANT = 0x2,
	CRITICAL = 0x3,
	MANDATORY = 0x4,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 5
// Alignment: 4
// Size: 0x4
enum class IBody__PostureType : std::uint32_t
{
	STAND = 0x0,
	CROUCH = 0x1,
	SIT = 0x2,
	CRAWL = 0x3,
	LIE = 0x4,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 8
// Alignment: 4
// Size: 0x4
enum class MLBot_MessageId : std::uint32_t
{
	mlbot_MatchMetadata = 0x1,
	mlbot_TickBoundary = 0x2,
	mlbot_TeamState_Radiant = 0x3,
	mlbot_TeamState_Radiant_Delta = 0x4,
	mlbot_TeamState_Dire = 0x5,
	mlbot_TeamState_Dire_Delta = 0x6,
	mlbot_PlayerCommand = 0x7,
	mlbot_PlayerOrder = 0x8,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 12
// Alignment: 4
// Size: 0x4
enum class Materials : std::uint32_t
{
	matGlass = 0x0,
	matWood = 0x1,
	matMetal = 0x2,
	matFlesh = 0x3,
	matCinderBlock = 0x4,
	matCeilingTile = 0x5,
	matComputer = 0x6,
	matUnbreakableGlass = 0x7,
	matRocks = 0x8,
	matWeb = 0x9,
	matNone = 0xa,
	matLastMaterial = 0xb,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 9
// Alignment: 2
// Size: 0x2
enum class SoundFlags_t : std::uint16_t
{
	// MPropertySuppressEnumerator
	// MEnumeratorIsNotAFlag
	SOUND_FLAGS_NONE = 0x0,
	SOUND_FLAG_GUNFIRE = 0x1,
	SOUND_FLAG_COMBINE_ONLY = 0x2,
	SOUND_FLAG_REACT_TO_SOURCE = 0x4,
	SOUND_FLAG_EXPLOSION = 0x8,
	SOUND_FLAG_EXCLUDE_COMBINE = 0x10,
	SOUND_FLAG_DANGER_APPROACH = 0x20,
	SOUND_FLAG_ALLIES_ONLY = 0x40,
	SOUND_FLAG_PANIC_NPCS = 0x80,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 2
// Alignment: 4
// Size: 0x4
enum class filter_t : std::uint32_t
{
	FILTER_AND = 0x0,
	FILTER_OR = 0x1,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 5
// Alignment: 4
// Size: 0x4
enum class Touch_t : std::uint32_t
{
	touch_none = 0x0,
	touch_player_only = 0x1,
	touch_npc_only = 0x2,
	touch_player_or_npc = 0x3,
	touch_player_or_npc_or_physicsprop = 0x4,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 3
// Alignment: 4
// Size: 0x4
enum class TrainVelocityType_t : std::uint32_t
{
	TrainVelocity_Instantaneous = 0x0,
	TrainVelocity_LinearBlend = 0x1,
	TrainVelocity_EaseInEaseOut = 0x2,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 3
// Alignment: 4
// Size: 0x4
enum class EntFinderMethod_t : std::uint32_t
{
	ENT_FIND_METHOD_NEAREST = 0x0,
	ENT_FIND_METHOD_FARTHEST = 0x1,
	ENT_FIND_METHOD_RANDOM = 0x2,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 3
// Alignment: 4
// Size: 0x4
enum class ForcedCrouchState_t : std::uint32_t
{
	FORCEDCROUCH_NONE = 0x0,
	FORCEDCROUCH_CROUCHED = 0x1,
	FORCEDCROUCH_UNCROUCHED = 0x2,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 8
// Alignment: 4
// Size: 0x4
enum class TOGGLE_STATE : std::uint32_t
{
	TS_AT_TOP = 0x0,
	TS_AT_BOTTOM = 0x1,
	TS_GOING_UP = 0x2,
	TS_GOING_DOWN = 0x3,
	DOOR_OPEN = 0x0,
	DOOR_CLOSED = 0x1,
	DOOR_OPENING = 0x2,
	DOOR_CLOSING = 0x3,
};

// Registered binary: server.dll (project 'navlib')
// Enumerator count: 20
// Alignment: 4
// Size: 0x4
enum class NavAttributeEnum : std::uint32_t
{
	NAV_MESH_AVOID = 0x80,
	NAV_MESH_STAIRS = 0x1000,
	NAV_MESH_NON_ZUP = 0x8000,
	NAV_MESH_SHORT_HEIGHT = 0x10000,
	NAV_MESH_NON_ZUP_TRANSITION = 0x20000,
	NAV_MESH_CROUCH = 0x10000,
	NAV_MESH_JUMP = 0x2,
	NAV_MESH_PRECISE = 0x4,
	NAV_MESH_NO_JUMP = 0x8,
	NAV_MESH_STOP = 0x10,
	NAV_MESH_RUN = 0x20,
	NAV_MESH_WALK = 0x40,
	NAV_MESH_TRANSIENT = 0x100,
	NAV_MESH_DONT_HIDE = 0x200,
	NAV_MESH_STAND = 0x400,
	NAV_MESH_NO_HOSTAGES = 0x800,
	NAV_MESH_NO_MERGE = 0x2000,
	NAV_MESH_OBSTACLE_TOP = 0x4000,
	NAV_ATTR_FIRST_GAME_INDEX = 0x13,
	NAV_ATTR_LAST_INDEX = 0x1f,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 3
// Alignment: 4
// Size: 0x4
enum class MoveLinearAuthoredPos_t : std::uint32_t
{
	MOVELINEAR_AUTHORED_AT_START_POSITION = 0x0,
	MOVELINEAR_AUTHORED_AT_OPEN_POSITION = 0x1,
	MOVELINEAR_AUTHORED_AT_CLOSED_POSITION = 0x2,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 12
// Alignment: 4
// Size: 0x4
enum class Hull_t : std::uint32_t
{
	HULL_HUMAN = 0x0,
	HULL_SMALL_CENTERED = 0x1,
	HULL_WIDE_HUMAN = 0x2,
	HULL_TINY = 0x3,
	HULL_MEDIUM = 0x4,
	HULL_TINY_CENTERED = 0x5,
	HULL_LARGE = 0x6,
	HULL_LARGE_CENTERED = 0x7,
	HULL_MEDIUM_TALL = 0x8,
	HULL_SMALL = 0x9,
	NUM_HULLS = 0xa,
	HULL_NONE = 0xb,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 4
// Alignment: 4
// Size: 0x4
enum class ScriptedMoveType_t : std::uint32_t
{
	SCRIPTED_MOVETYPE_NONE = 0x0,
	SCRIPTED_MOVETYPE_TO_WITH_DURATION = 0x1,
	SCRIPTED_MOVETYPE_TO_WITH_MOVESPEED = 0x2,
	SCRIPTED_MOVETYPE_SWEEP_TO_AT_MOVEMENT_SPEED = 0x3,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 6
// Alignment: 4
// Size: 0x4
enum class PetCoopStates_t : std::uint32_t
{
	COOP_IGNORE = 0x0,
	COOPTELEPORT_START_PERFORMING = 0x1,
	COOPTELEPORT_PLAY_ENDANIM = 0x2,
	COOPTELEPORT_PLAY_EXITANIM = 0x3,
	COOP_WARD_OBSERVER = 0x4,
	COOP_WARD_SENTRY = 0x5,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 2
// Alignment: 4
// Size: 0x4
enum class ScriptedConflictResponse_t : std::uint32_t
{
	SS_CONFLICT_ENQUEUE = 0x0,
	SS_CONFLICT_INTERRUPT = 0x1,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 4
// Alignment: 4
// Size: 0x4
enum class EPoorNetworkConditionsType : std::uint32_t
{
	k_EPoorNetworkConditions_None = 0x0,
	k_EPoorNetworkConditions_Unknown = 0x1,
	k_EPoorNetworkConditions_MassDisconnect = 0x2,
	k_EPoorNetworkConditions_ExcessBadQosIntervals = 0x3,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 3
// Alignment: 4
// Size: 0x4
enum class TrackOrientationType_t : std::uint32_t
{
	TrackOrientation_Fixed = 0x0,
	TrackOrientation_FacePath = 0x1,
	TrackOrientation_FacePathAngles = 0x2,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 5
// Alignment: 4
// Size: 0x4
enum class ObstructionRelationshipClass_t : std::uint32_t
{
	DOTA_OBSTRUCTION_RELATIONSHIP_NONE = 0x0,
	DOTA_OBSTRUCTION_RELATIONSHIP_BUILDING = 0x1,
	DOTA_OBSTRUCTION_RELATIONSHIP_PLAYER_CONTROLLED = 0x2,
	DOTA_OBSTRUCTION_RELATIONSHIP_NPC = 0x3,
	DOTA_OBSTRUCTION_RELATIONSHIP_LAST = 0x4,
};

// Registered binary: server.dll (project 'navlib')
// Enumerator count: 5
// Alignment: 4
// Size: 0x4
enum class NavDirType : std::uint32_t
{
	NORTH = 0x0,
	EAST = 0x1,
	SOUTH = 0x2,
	WEST = 0x3,
	NUM_NAV_DIR_TYPE_DIRECTIONS = 0x4,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 3
// Alignment: 4
// Size: 0x4
enum class SimpleConstraintSoundProfile__SimpleConstraintsSoundProfileKeypoints_t : std::uint32_t
{
	kMIN_THRESHOLD = 0x0,
	kMIN_FULL = 0x1,
	kHIGHWATER = 0x2,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 1
// Alignment: 4
// Size: 0x4
enum class navproperties_t : std::uint32_t
{
	NAV_IGNORE = 0x1,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 3
// Alignment: 4
// Size: 0x4
enum class eSplinePushType : std::uint32_t
{
	// MPropertyFriendlyName "Along Spline Direction"
	k_eSplinePushAlong = 0x0,
	// MPropertyFriendlyName "Away from closest point"
	k_eSplinePushAway = 0x1,
	// MPropertyFriendlyName "Towards closest point"
	k_eSplinePushTowards = 0x2,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 3
// Alignment: 4
// Size: 0x4
enum class TRAIN_CODE : std::uint32_t
{
	TRAIN_SAFE = 0x0,
	TRAIN_BLOCKING = 0x1,
	TRAIN_FOLLOWING = 0x2,
};

// Registered binary: server.dll (project 'server')
// Enumerator count: 3
// Alignment: 4
// Size: 0x4
enum class EOverrideBlockLOS_t : std::uint32_t
{
	BLOCK_LOS_DEFAULT = 0x0,
	BLOCK_LOS_FORCE_FALSE = 0x1,
	BLOCK_LOS_FORCE_TRUE = 0x2,
};

struct GameTime_t;
struct PlayerID_t;
struct CEntityIOOutput;
struct ParticleIndex_t;
struct fogparams_t;
struct CountdownTimer;
struct CDOTA_BaseNPC;
struct CSkeletonInstance;
struct CPathSimple;
struct attrib_definition_index_t;
struct CBaseAnimatingOverlayController;
struct CDOTABehaviorMoveTo;
struct fogplayerparams_t;
struct audioparams_t;
struct CNetworkVarChainer;
struct CGameSceneNode;
struct CModelState;
struct CBaseAnimGraphController;
struct GameTick_t;
struct CDOTA_ModifierManager;
struct CLocomotionBase;
struct IBody;
struct CUnitOrders;
struct CDOTA_UnitInventory;
struct CLocalNPCObstructionsCache;
struct item_definition_index_t;
struct CPhysicsShake;
struct CPathKeyFrame;
struct itemid_t;
struct AbilityID_t;
struct AttachmentHandle_t;
struct GuildID_t;
struct CEconItemView;
struct CPathTrack;
struct CFuncTrackTrain;
struct CSoundPatch;
struct HSequence;
struct IChoreoServices;
struct PhysicsRagdollPose_t;
struct CDOTA_Tree;
struct ragdoll_t;
struct CDOTABaseAbility;
struct CDOTA_ArcanaDataEntity_DrowRanger;
struct CDOTA_ArcanaDataEntity_FacelessVoid;
struct CDOTA_ArcanaDataEntity_Razor;
struct CDOTA_Buff;
struct AmmoIndex_t;
struct CDotaEntityFilterFlags;
struct dynpitchvol_t;
struct ModelConfigHandle_t;
struct CModifierParams;
struct CDOTA_BaseNPC_Hero::KillInfo_t;
struct sLoadoutItem;
struct CDOTAMusicProbabilityEntry;
struct CNetworkedSequenceOperation;
struct sky3dparams_t;
struct CSkyCamera;
struct CPointCamera;
struct CDOTASpectatorGraphManager;
struct CAttributeManager;
struct CDOTAGameRules;
struct CMotorController;
struct CInButtonState;
struct CSkillFloat;
struct ConstraintSoundInfo;
struct CLightComponent;
struct CRenderComponent;
struct CHitboxComponent;
struct CCollisionProperty;
struct CGlowProperty;
struct CNetworkViewOffsetVector;
struct sSpiritInfo;
struct PeriodicResourceID_t;
struct CDOTA_TeamCommander;
struct CConstantForceController;
struct CBaseAnimatingController;
struct TrackedStatID_t;
struct TrackedStatValue_t;
struct CDOTAGameManager;
struct CAttributeContainer;
struct VPhysicsCollisionAttribute_t;
struct CavernCrawlMapVariant_t;
struct CSequenceTransitioner2;
struct ChangeAccessorFieldPathIndex_t;
struct CEntityIdentity;
struct style_index_t;
struct CAttributeList;
struct CPlayer_WeaponServices;
struct CPlayer_ItemServices;
struct CPlayer_AutoaimServices;
struct CPlayer_ObserverServices;
struct CPlayer_WaterServices;
struct CPlayer_UseServices;
struct CPlayer_FlashlightServices;
struct CPlayer_CameraServices;
struct CPlayer_MovementServices;
struct CAI_Expresser;
struct CDOTA_CreepKillInfo;
struct constraint_hingeparams_t;
struct CScriptComponent;
struct LeagueID_t;
struct DOTA_AssassinMinigameNetworkState;
struct MatchID_t;
struct EngineCountdownTimer;
struct CEntityInstance;
struct CGameSceneNodeHandle;
struct CNetworkOriginCellCoordQuantizedVector;
struct CBodyComponent;
struct CNetworkTransmitComponent;
struct CNetworkVelocityVector;
struct AISound_t;
struct CBaseFlex;
struct VelocitySampler;
struct SimpleConstraintSoundProfile;
struct INextBotReply;
struct CRR_Response;
struct ResponseFollowup;
struct CResponseCriteriaSet;

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1340
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_BigThunderLizard_Slam : public CDOTA_Buff
{
public:
	int32_t movespeed_slow; // 0x1338	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1338
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_AghsFort_Blessings_Debuff_Duration_Increase : public CDOTA_Buff
{
public:
	// No schema binary for binding
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1338
// Has VTable
// Is Abstract
// MNetworkAssumeNotNetworkable
class CDOTA_Buff_Item : public CDOTA_Buff
{
public:
	// No schema binary for binding
};

// Registered binary: server.dll (project 'entity2')
// Alignment: 8
// Size: 0x38
// Has VTable
// Construct disallowed
// MConstructibleClassBase
// 
// MNetworkVarNames "CEntityIdentity * m_pEntity"
// MNetworkVarNames "CScriptComponent::Storage_t m_CScriptComponent"
class CEntityInstance
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkDisable
	CUtlSymbolLarge m_iszPrivateVScripts; // 0x8	
	// MNetworkEnable
	// MNetworkPriority "56"
	CEntityIdentity* m_pEntity; // 0x10	
private:
	[[maybe_unused]] uint8_t __pad0018[0x10]; // 0x18
public:
	// MNetworkEnable
	// MNetworkDisable
	CScriptComponent* m_CScriptComponent; // 0x28	
	bool m_bVisibleinPVS; // 0x30	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x4a8
// Has VTable
// Construct allowed
// MNetworkAssumeNotNetworkable
// 
// MNetworkExcludeByName "m_bClientSideRagdoll"
// MNetworkExcludeByName "m_iMaxHealth"
// MNetworkExcludeByUserGroup "Water"
// MNetworkExcludeByUserGroup "Player"
// MNetworkExcludeByUserGroup "LocalPlayerExclusive"
// MNetworkExcludeByName "m_spawnflags"
// MNetworkExcludeByName "m_bTakesDamage"
// MNetworkExcludeByName "m_nTakeDamageFlags"
// MNetworkExcludeByName "m_flSpeed"
// MNetworkVarNames "CBodyComponent::Storage_t m_CBodyComponent"
// MNetworkVarNames "int32 m_iHealth"
// MNetworkVarNames "int32 m_iMaxHealth"
// MNetworkVarNames "uint8 m_lifeState"
// MNetworkVarNames "DamageOptions_t m_takedamage"
// MNetworkVarNames "bool m_bTakesDamage"
// MNetworkVarNames "TakeDamageFlags_t m_nTakeDamageFlags"
// MNetworkVarNames "bool m_bIsPlatform"
// MNetworkVarNames "MoveCollide_t m_MoveCollide"
// MNetworkVarNames "MoveType_t m_MoveType"
// MNetworkVarNames "EntitySubclassID_t m_nSubclassID"
// MNetworkVarNames "float32 m_flAnimTime"
// MNetworkVarNames "float32 m_flSimulationTime"
// MNetworkVarNames "GameTime_t m_flCreateTime"
// MNetworkVarNames "bool m_bClientSideRagdoll"
// MNetworkVarNames "uint8 m_ubInterpolationFrame"
// MNetworkVarNames "uint8 m_iTeamNum"
// MNetworkVarNames "float m_flSpeed"
// MNetworkVarNames "uint32 m_spawnflags"
// MNetworkVarNames "GameTick_t m_nNextThinkTick"
// MNetworkVarNames "uint32 m_fFlags"
// MNetworkVarNames "CNetworkVelocityVector m_vecVelocity"
// MNetworkVarNames "CHandle< CBaseEntity> m_hEffectEntity"
// MNetworkVarNames "CHandle< CBaseEntity> m_hOwnerEntity"
// MNetworkVarNames "uint32 m_fEffects"
// MNetworkVarNames "CHandle< CBaseEntity> m_hGroundEntity"
// MNetworkVarNames "int m_nGroundBodyIndex"
// MNetworkVarNames "float32 m_flFriction"
// MNetworkVarNames "float32 m_flElasticity"
// MNetworkVarNames "float32 m_flGravityScale"
// MNetworkVarNames "float32 m_flTimeScale"
// MNetworkVarNames "float m_flWaterLevel"
// MNetworkVarNames "bool m_bAnimatedEveryTick"
// MNetworkVarNames "GameTime_t m_flNavIgnoreUntilTime"
class CBaseEntity : public CEntityInstance
{
public:
	// MNetworkEnable
	// MNetworkUserGroup "CBodyComponent"
	// MNetworkAlias "CBodyComponent"
	// MNetworkTypeAlias "CBodyComponent"
	// MNetworkPriority "48"
	CBodyComponent* m_CBodyComponent; // 0x38	
	CNetworkTransmitComponent m_NetworkTransmitComponent; // 0x40	
private:
	[[maybe_unused]] uint8_t __pad01e0[0x40]; // 0x1e0
public:
	CUtlVector< thinkfunc_t > m_aThinkFunctions; // 0x220	
	int32_t m_iCurrentThinkContext; // 0x238	
	GameTick_t m_nLastThinkTick; // 0x23c	
	bool m_bDisabledContextThinks; // 0x240	
private:
	[[maybe_unused]] uint8_t __pad0241[0xf]; // 0x241
public:
	CBitVec< 64 > m_isSteadyState; // 0x250	
	float m_lastNetworkChange; // 0x258	
private:
	[[maybe_unused]] uint8_t __pad025c[0xc]; // 0x25c
public:
	CUtlVector< ResponseContext_t > m_ResponseContexts; // 0x268	
	CUtlSymbolLarge m_iszResponseContext; // 0x280	
private:
	[[maybe_unused]] uint8_t __pad0288[0x20]; // 0x288
public:
	// MNetworkEnable
	// MNetworkSerializer "ClampHealth"
	// MNetworkUserGroup "Player"
	// MNetworkPriority "32"
	int32_t m_iHealth; // 0x2a8	
	// MNetworkEnable
	int32_t m_iMaxHealth; // 0x2ac	
	// MNetworkEnable
	// MNetworkUserGroup "Player"
	// MNetworkPriority "32"
	uint8_t m_lifeState; // 0x2b0	
private:
	[[maybe_unused]] uint8_t __pad02b1[0x3]; // 0x2b1
public:
	float m_flDamageAccumulator; // 0x2b4	
	// MNetworkEnable
	DamageOptions_t m_takedamage; // 0x2b8	
	// MNetworkEnable
	bool m_bTakesDamage; // 0x2b9	
private:
	[[maybe_unused]] uint8_t __pad02ba[0x2]; // 0x2ba
public:
	// MNetworkEnable
	TakeDamageFlags_t m_nTakeDamageFlags; // 0x2bc	
	// MNetworkEnable
	bool m_bIsPlatform; // 0x2c0	
private:
	[[maybe_unused]] uint8_t __pad02c1[0x1]; // 0x2c1
public:
	// MNetworkEnable
	MoveCollide_t m_MoveCollide; // 0x2c2	
	// MNetworkEnable
	MoveType_t m_MoveType; // 0x2c3	
	MoveType_t m_nActualMoveType; // 0x2c4	
	uint8_t m_nWaterTouch; // 0x2c5	
	uint8_t m_nSlimeTouch; // 0x2c6	
	bool m_bRestoreInHierarchy; // 0x2c7	
	CUtlSymbolLarge m_target; // 0x2c8	
	CHandle< CBaseFilter > m_hDamageFilter; // 0x2d0	
private:
	[[maybe_unused]] uint8_t __pad02d4[0x4]; // 0x2d4
public:
	CUtlSymbolLarge m_iszDamageFilterName; // 0x2d8	
	float m_flMoveDoneTime; // 0x2e0	
	// MNetworkEnable
	// MNetworkSendProxyRecipientsFilter
	CUtlStringToken m_nSubclassID; // 0x2e4	
private:
	[[maybe_unused]] uint8_t __pad02e8[0x8]; // 0x2e8
public:
	// MNetworkEnable
	// MNetworkPriority "0"
	// MNetworkSerializer "animTimeSerializer"
	// MNetworkSendProxyRecipientsFilter
	float m_flAnimTime; // 0x2f0	
	// MNetworkEnable
	// MNetworkPriority "1"
	// MNetworkSerializer "simulationTimeSerializer"
	// MNetworkSendProxyRecipientsFilter
	float m_flSimulationTime; // 0x2f4	
	// MNetworkEnable
	GameTime_t m_flCreateTime; // 0x2f8	
	// MNetworkEnable
	bool m_bClientSideRagdoll; // 0x2fc	
	// MNetworkEnable
	uint8_t m_ubInterpolationFrame; // 0x2fd	
private:
	[[maybe_unused]] uint8_t __pad02fe[0x2]; // 0x2fe
public:
	Vector m_vPrevVPhysicsUpdatePos; // 0x300	
	// MNetworkEnable
	uint8_t m_iTeamNum; // 0x30c	
private:
	[[maybe_unused]] uint8_t __pad030d[0x3]; // 0x30d
public:
	CUtlSymbolLarge m_iGlobalname; // 0x310	
	int32_t m_iSentToClients; // 0x318	
	// MNetworkEnable
	float m_flSpeed; // 0x31c	
	CUtlString m_sUniqueHammerID; // 0x320	
	// MNetworkEnable
	uint32_t m_spawnflags; // 0x328	
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	GameTick_t m_nNextThinkTick; // 0x32c	
	int32_t m_nSimulationTick; // 0x330	
private:
	[[maybe_unused]] uint8_t __pad0334[0x4]; // 0x334
public:
	CEntityIOOutput m_OnKilled; // 0x338	
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkUserGroup "Player"
	uint32_t m_fFlags; // 0x360	
	Vector m_vecAbsVelocity; // 0x364	
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	// MNetworkPriority "32"
	CNetworkVelocityVector m_vecVelocity; // 0x370	
private:
	[[maybe_unused]] uint8_t __pad0398[0x8]; // 0x398
public:
	int32_t m_nPushEnumCount; // 0x3a0	
private:
	[[maybe_unused]] uint8_t __pad03a4[0x4]; // 0x3a4
public:
	CCollisionProperty* m_pCollision; // 0x3a8	
	// MNetworkEnable
	CHandle< CBaseEntity > m_hEffectEntity; // 0x3b0	
	// MNetworkEnable
	// MNetworkPriority "32"
	CHandle< CBaseEntity > m_hOwnerEntity; // 0x3b4	
	// MNetworkEnable
	// MNetworkChangeCallback "OnEffectsChanged"
	uint32_t m_fEffects; // 0x3b8	
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkUserGroup "Player"
	CHandle< CBaseEntity > m_hGroundEntity; // 0x3bc	
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkUserGroup "Player"
	int32_t m_nGroundBodyIndex; // 0x3c0	
	// MNetworkEnable
	// MNetworkBitCount "8"
	// MNetworkMinValue "0,000000"
	// MNetworkMaxValue "4,000000"
	// MNetworkEncodeFlags "1"
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flFriction; // 0x3c4	
	// MNetworkEnable
	// MNetworkEncoder "coord"
	float m_flElasticity; // 0x3c8	
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flGravityScale; // 0x3cc	
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flTimeScale; // 0x3d0	
	// MNetworkEnable
	// MNetworkUserGroup "Water"
	// MNetworkBitCount "8"
	// MNetworkMinValue "0,000000"
	// MNetworkMaxValue "1,000000"
	// MNetworkEncodeFlags "8"
	float m_flWaterLevel; // 0x3d4	
	// MNetworkEnable
	bool m_bAnimatedEveryTick; // 0x3d8	
	bool m_bDisableLowViolence; // 0x3d9	
	uint8_t m_nWaterType; // 0x3da	
private:
	[[maybe_unused]] uint8_t __pad03db[0x1]; // 0x3db
public:
	int32_t m_iEFlags; // 0x3dc	
	CEntityIOOutput m_OnUser1; // 0x3e0	
	CEntityIOOutput m_OnUser2; // 0x408	
	CEntityIOOutput m_OnUser3; // 0x430	
	CEntityIOOutput m_OnUser4; // 0x458	
	int32_t m_iInitialTeamNum; // 0x480	
	// MNetworkEnable
	GameTime_t m_flNavIgnoreUntilTime; // 0x484	
	QAngle m_vecAngVelocity; // 0x488	
	bool m_bNetworkQuantizeOriginAndAngles; // 0x494	
	bool m_bLagCompensate; // 0x495	
private:
	[[maybe_unused]] uint8_t __pad0496[0x2]; // 0x496
public:
	float m_flOverriddenFriction; // 0x498	
	CHandle< CBaseEntity > m_pBlocker; // 0x49c	
	float m_flLocalTime; // 0x4a0	
	float m_flVPhysicsUpdateLocalTime; // 0x4a4	
	
	// Static fields:
	static Relationship_t** &Get_sm_DefaultRelationship(){return *reinterpret_cast<Relationship_t***>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CBaseEntity")->GetStaticFields()[0]->m_pInstance);};
	static bool &Get_sm_bAccurateTriggerBboxChecks(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CBaseEntity")->GetStaticFields()[1]->m_pInstance);};
	static bool &Get_sm_bDisableTouchFuncs(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CBaseEntity")->GetStaticFields()[2]->m_pInstance);};
	static bool &Get_m_bAllowPrecache(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CBaseEntity")->GetStaticFields()[3]->m_pInstance);};
	static bool &Get_s_bAbsQueriesValid(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CBaseEntity")->GetStaticFields()[4]->m_pInstance);};
	static bool &Get_s_bPreventingSetAnimRunAnimEvents(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CBaseEntity")->GetStaticFields()[5]->m_pInstance);};
	static int32_t &Get_m_nPredictionRandomSeed(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CBaseEntity")->GetStaticFields()[6]->m_pInstance);};
	static int32_t &Get_m_nPredictionRandomSeedServer(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CBaseEntity")->GetStaticFields()[7]->m_pInstance);};
	static CBasePlayerController* &Get_m_pPredictionPlayerController(){return *reinterpret_cast<CBasePlayerController**>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CBaseEntity")->GetStaticFields()[8]->m_pInstance);};
	static bool &Get_sm_bDatadescValidating(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CBaseEntity")->GetStaticFields()[9]->m_pInstance);};
	
	// Datamap fields:
	// CUtlSymbolLarge m_iszPrivateVScripts; // 0x8
	// void m_CScriptComponent; // 0x28
	// CUtlSymbolLarge subclass_name; // 0x7fffffff
	// void m_pSubclassVData; // 0x2e8
	// void* m_think; // 0x260
	// void* m_pfnTouch; // 0x288
	// void* m_pfnUse; // 0x290
	// void* m_pfnBlocked; // 0x298
	// void* m_pfnMoveDone; // 0x2a0
	// int32_t InputSetTeam; // 0x0
	// void InputKill; // 0x0
	// void InputKillHierarchy; // 0x0
	// int32_t InputUse; // 0x0
	// bool InputAlternativeSorting; // 0x0
	// CUtlSymbolLarge InputSetParent; // 0x0
	// CUtlSymbolLarge InputSetParentAttachment; // 0x0
	// CUtlSymbolLarge InputSetParentAttachmentMaintainOffset; // 0x0
	// void InputClearParent; // 0x0
	// CUtlSymbolLarge InputFollowEntity; // 0x0
	// CUtlSymbolLarge InputSetDamageFilter; // 0x0
	// void InputEnableDamageForces; // 0x0
	// void InputDisableDamageForces; // 0x0
	// CUtlSymbolLarge InputDispatchResponse; // 0x0
	// CUtlSymbolLarge InputAddContext; // 0x0
	// CUtlSymbolLarge InputRemoveContext; // 0x0
	// void InputClearContext; // 0x0
	// CUtlSymbolLarge InputAddAttribute; // 0x0
	// CUtlSymbolLarge InputRemoveAttribute; // 0x0
	// void InputDisableShadow; // 0x0
	// void InputEnableShadow; // 0x0
	// CUtlSymbolLarge InputFireUser1; // 0x0
	// CUtlSymbolLarge InputFireUser2; // 0x0
	// CUtlSymbolLarge InputFireUser3; // 0x0
	// CUtlSymbolLarge InputFireUser4; // 0x0
	// CUtlSymbolLarge InputChangeSubclass; // 0x0
	// void InputPlatformEnable; // 0x0
	// void InputPlatformDisable; // 0x0
	// void CBaseEntitySUB_Remove; // 0x0
	// void CBaseEntitySUB_RemoveIfUncarried; // 0x0
	// void CBaseEntitySUB_DoNothing; // 0x0
	// void CBaseEntitySUB_Vanish; // 0x0
	// void CBaseEntitySUB_CallUseToggle; // 0x0
	// void CBaseEntitySUB_KillSelf; // 0x0
	// void CBaseEntitySUB_KillSelfIfUncarried; // 0x0
	// void CBaseEntityFrictionRevertThink; // 0x0
	// void CBaseEntityFakeScriptThinkFunc; // 0x0
	// void CBaseEntityClearNavIgnoreContentsThink; // 0x0
	// void m_pGameSceneNode; // 0x248
	// void m_nEntityType; // 0x2c1
	// QAngle angles; // 0x7fffffff
	// Vector origin; // 0x7fffffff
	// CStrongHandle< InfoForResourceTypeCModel > model; // 0x7fffffff
	// CUtlString ownername; // 0x7fffffff
	// int32_t disableshadows; // 0x7fffffff
	// int32_t disablereceiveshadows; // 0x7fffffff
	// int32_t nodamageforces; // 0x7fffffff
	// float angle; // 0x7fffffff
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1348
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_Skywrath_Mage_Mystic_Flare : public CDOTA_Buff
{
public:
	int32_t radius; // 0x1338	
	int32_t damage; // 0x133c	
	float duration; // 0x1340	
	float damage_interval; // 0x1344	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1340
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_Magnataur_Skewer_Slow : public CDOTA_Buff
{
public:
	int32_t slow_pct; // 0x1338	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1340
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_Meepo_Divided_We_Stand : public CDOTA_Buff
{
public:
	float respawn; // 0x1338	
	float magic_resist; // 0x133c	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x578
// Has VTable
// Construct allowed
// MClassHasEntityLimitedDataDesc
// MNetworkAssumeNotNetworkable
// 
// MNetworkExcludeByName "m_angRotation"
// MNetworkExcludeByName "m_blinktoggle"
// MNetworkExcludeByName "m_cellX"
// MNetworkExcludeByName "m_cellY"
// MNetworkExcludeByName "m_cellZ"
// MNetworkExcludeByName "m_flAnimTime"
// MNetworkExcludeByUserGroup "m_flCycle"
// MNetworkExcludeByName "m_flEncodedController"
// MNetworkExcludeByName "m_flPoseParameter"
// MNetworkExcludeByName "m_flSimulationTime"
// MNetworkExcludeByName "m_flexWeight"
// MNetworkExcludeByName "m_nForceBone"
// MNetworkExcludeByName "m_nHitboxSet"
// MNetworkExcludeByName "m_baseLayer.m_hSequence"
// MNetworkExcludeByName "m_vecForce"
// MNetworkExcludeByName "m_vecMaxs"
// MNetworkExcludeByName "m_vecMins"
// MNetworkExcludeByName "m_vecOrigin"
// MNetworkExcludeByName "m_vecSpecifiedSurroundingMaxs"
// MNetworkExcludeByName "m_vecSpecifiedSurroundingMins"
// MNetworkExcludeByName "m_vLookTargetPosition"
// MNetworkExcludeByUserGroup "overlay_vars"
// MNetworkExcludeByName "m_hOwnerEntity"
// MNetworkExcludeByName "m_hParent"
// MNetworkExcludeByName "m_flCreateTime"
// MNetworkExcludeByName "m_flScale"
// MNetworkVarNames "bool m_bRefCountsModifiers"
// MNetworkVarNames "bool m_bHidden"
// MNetworkVarNames "bool m_bActivated"
// MNetworkVarNames "AbilityBarType_t m_nAbilityBarType"
// MNetworkVarNames "int m_iDirtyButtons"
// MNetworkVarNames "int m_iLevel"
// MNetworkVarNames "bool m_bToggleState"
// MNetworkVarNames "bool m_bInAbilityPhase"
// MNetworkVarNames "float m_flAbilityMuteDuration"
// MNetworkVarNames "float m_fCooldown"
// MNetworkVarNames "float m_flCooldownLength"
// MNetworkVarNames "int m_iManaCost"
// MNetworkVarNames "bool m_bAutoCastState"
// MNetworkVarNames "bool m_bAltCastState"
// MNetworkVarNames "GameTime_t m_flChannelStartTime"
// MNetworkVarNames "GameTime_t m_flCastStartTime"
// MNetworkVarNames "bool m_bInIndefiniteCooldown"
// MNetworkVarNames "bool m_bFrozenCooldown"
// MNetworkVarNames "float m_flOverrideCastPoint"
// MNetworkVarNames "bool m_bStolen"
// MNetworkVarNames "bool m_bReplicated"
// MNetworkVarNames "bool m_bStealable"
// MNetworkVarNames "int m_nAbilityCurrentCharges"
// MNetworkVarNames "float m_fAbilityChargeRestoreTimeRemaining"
// MNetworkVarNames "bool m_bUpgradeRecommended"
// MNetworkVarNames "int m_nMaxLevelOverride"
// MNetworkVarNames "float m_flTotalExtendedChannelTime"
class CDOTABaseAbility : public CBaseEntity
{
private:
	[[maybe_unused]] uint8_t __pad04a8[0x8]; // 0x4a8
public:
	int32_t m_iAbilityIndex; // 0x4b0	
	int32_t m_nStolenActivity; // 0x4b4	
	bool m_bChanneling; // 0x4b8	
	bool m_bReflection; // 0x4b9	
	// MNetworkEnable
	bool m_bRefCountsModifiers; // 0x4ba	
private:
	[[maybe_unused]] uint8_t __pad04bb[0x1]; // 0x4bb
public:
	int32_t m_iModifierRefCount; // 0x4bc	
	bool m_bWantsToNeutralCast; // 0x4c0	
private:
	[[maybe_unused]] uint8_t __pad04c1[0x3]; // 0x4c1
public:
	CHandle< CBaseEntity > m_hNeutralCastTarget; // 0x4c4	
	bool m_bServerOnlyAbility; // 0x4c8	
	bool m_bGrantedAbilityChargesFromScepter; // 0x4c9	
	bool m_bGrantedAbilityChargesFromShard; // 0x4ca	
	bool m_bIsDefaultHeroAbility; // 0x4cb	
	bool m_bConsiderOvershootInGetCastRange; // 0x4cc	
private:
	[[maybe_unused]] uint8_t __pad04cd[0x3]; // 0x4cd
public:
	float m_flExtendChannelTime; // 0x4d0	
	// MNetworkEnable
	bool m_bHidden; // 0x4d4	
	// MNetworkEnable
	bool m_bActivated; // 0x4d5	
private:
	[[maybe_unused]] uint8_t __pad04d6[0x2]; // 0x4d6
public:
	// MNetworkEnable
	AbilityBarType_t m_nAbilityBarType; // 0x4d8	
	// MNetworkEnable
	int32_t m_iDirtyButtons; // 0x4dc	
	// MNetworkEnable
	// MNetworkPriority "32"
	int32_t m_iLevel; // 0x4e0	
	// MNetworkEnable
	bool m_bToggleState; // 0x4e4	
	// MNetworkEnable
	// MNetworkPriority "32"
	bool m_bInAbilityPhase; // 0x4e5	
private:
	[[maybe_unused]] uint8_t __pad04e6[0x2]; // 0x4e6
public:
	// MNetworkEnable
	float m_flAbilityMuteDuration; // 0x4e8	
	// MNetworkEnable
	// MNetworkPriority "32"
	float m_fCooldown; // 0x4ec	
	// MNetworkEnable
	// MNetworkBitCount "15"
	// MNetworkMinValue "0,000000"
	// MNetworkMaxValue "1024,000000"
	float m_flCooldownLength; // 0x4f0	
	// MNetworkEnable
	// MNetworkPriority "32"
	int32_t m_iManaCost; // 0x4f4	
	// MNetworkEnable
	// MNetworkPriority "32"
	bool m_bAutoCastState; // 0x4f8	
	// MNetworkEnable
	// MNetworkPriority "32"
	bool m_bAltCastState; // 0x4f9	
private:
	[[maybe_unused]] uint8_t __pad04fa[0x2]; // 0x4fa
public:
	// MNetworkEnable
	GameTime_t m_flChannelStartTime; // 0x4fc	
	// MNetworkEnable
	GameTime_t m_flCastStartTime; // 0x500	
	// MNetworkEnable
	bool m_bInIndefiniteCooldown; // 0x504	
	// MNetworkEnable
	bool m_bFrozenCooldown; // 0x505	
private:
	[[maybe_unused]] uint8_t __pad0506[0x2]; // 0x506
public:
	int32_t m_nFrozenCooldownStack; // 0x508	
	// MNetworkEnable
	float m_flOverrideCastPoint; // 0x50c	
	// MNetworkEnable
	bool m_bStolen; // 0x510	
	// MNetworkEnable
	bool m_bReplicated; // 0x511	
	// MNetworkEnable
	bool m_bStealable; // 0x512	
private:
	[[maybe_unused]] uint8_t __pad0513[0x1]; // 0x513
public:
	// MNetworkEnable
	int32_t m_nAbilityCurrentCharges; // 0x514	
	// MNetworkEnable
	// MNetworkPriority "32"
	float m_fAbilityChargeRestoreTimeRemaining; // 0x518	
	// MNetworkEnable
	bool m_bUpgradeRecommended; // 0x51c	
private:
	[[maybe_unused]] uint8_t __pad051d[0x3]; // 0x51d
public:
	// MNetworkEnable
	int32_t m_nMaxLevelOverride; // 0x520	
	// MNetworkEnable
	float m_flTotalExtendedChannelTime; // 0x524	
	CHandle< CBaseEntity > m_hReflectionCause; // 0x528	
private:
	[[maybe_unused]] uint8_t __pad052c[0x24]; // 0x52c
public:
	CHandle< CBaseEntity > m_pReflectionSourceAbility; // 0x550	
private:
	[[maybe_unused]] uint8_t __pad0554[0xc]; // 0x554
public:
	item_definition_index_t m_nBackedByEconItemIndex; // 0x560	
private:
	[[maybe_unused]] uint8_t __pad0564[0xd]; // 0x564
public:
	bool m_bAltCastOrdered; // 0x571	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1340
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_Broodmother_SpinWeb_Thinker : public CDOTA_Buff
{
public:
	int32_t radius; // 0x1338	
	int32_t m_nFXIndex; // 0x133c	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x620
// Has VTable
// Construct allowed
// MClassHasEntityLimitedDataDesc
// MNetworkAssumeNotNetworkable
// 
// MNetworkVarNames "bool m_bCombinable"
// MNetworkVarNames "bool m_bPermanent"
// MNetworkVarNames "bool m_bStackable"
// MNetworkVarNames "int m_iStackableMax"
// MNetworkVarNames "bool m_bRecipe"
// MNetworkVarNames "bool m_bRecipeConsumesCharges"
// MNetworkVarNames "int m_iSharability"
// MNetworkVarNames "bool m_bDroppable"
// MNetworkVarNames "bool m_bPurchasable"
// MNetworkVarNames "bool m_bSellable"
// MNetworkVarNames "bool m_bInitiallySellable"
// MNetworkVarNames "bool m_bForceUnsellable"
// MNetworkVarNames "bool m_bRequiresCharges"
// MNetworkVarNames "bool m_bKillable"
// MNetworkVarNames "bool m_bGloballyCombinable"
// MNetworkVarNames "bool m_bDisassemblable"
// MNetworkVarNames "bool m_bIsNeutralDrop"
// MNetworkVarNames "int m_nNeutralDropTeam"
// MNetworkVarNames "bool m_bAlertable"
// MNetworkVarNames "int m_iInitialCharges"
// MNetworkVarNames "bool m_bCastOnPickup"
// MNetworkVarNames "bool m_bOnlyPlayerHeroPickup"
// MNetworkVarNames "bool m_bCreepHeroPickup"
// MNetworkVarNames "bool m_bCanBeUsedOutOfInventory"
// MNetworkVarNames "bool m_bItemEnabled"
// MNetworkVarNames "GameTime_t m_flEnableTime"
// MNetworkVarNames "GameTime_t m_flReclaimTime"
// MNetworkVarNames "bool m_bDisplayOwnership"
// MNetworkVarNames "bool m_bShowOnMinimap"
// MNetworkVarNames "float m_flMinimapIconSize"
// MNetworkVarNames "bool m_bIsUpgradeable"
// MNetworkVarNames "int m_nUpgradeProgress"
// MNetworkVarNames "int m_nUpgradeGoal"
// MNetworkVarNames "uint8 m_vecPreGameTransferPlayerIDs"
// MNetworkVarNames "GameTime_t m_flPurchaseTime"
// MNetworkVarNames "GameTime_t m_flAssembledTime"
// MNetworkVarNames "int m_iCurrentCharges"
// MNetworkVarNames "int m_iValuelessCharges"
// MNetworkVarNames "int m_iSecondaryCharges"
// MNetworkVarNames "bool m_bCombineLocked"
// MNetworkVarNames "PlayerID_t m_iPlayerOwnerID"
// MNetworkVarNames "bool m_bPurchasedWhileDead"
class CDOTA_Item : public CDOTABaseAbility
{
public:
	int32_t m_iState; // 0x578	
	int32_t m_CastAnimation; // 0x57c	
	// MNetworkEnable
	bool m_bCombinable; // 0x580	
	// MNetworkEnable
	// MNetworkPriority "32"
	bool m_bPermanent; // 0x581	
	// MNetworkEnable
	// MNetworkPriority "32"
	bool m_bStackable; // 0x582	
private:
	[[maybe_unused]] uint8_t __pad0583[0x1]; // 0x583
public:
	// MNetworkEnable
	// MNetworkPriority "32"
	int32_t m_iStackableMax; // 0x584	
	// MNetworkEnable
	bool m_bRecipe; // 0x588	
	// MNetworkEnable
	bool m_bRecipeConsumesCharges; // 0x589	
private:
	[[maybe_unused]] uint8_t __pad058a[0x2]; // 0x58a
public:
	// MNetworkEnable
	// MNetworkPriority "32"
	int32_t m_iSharability; // 0x58c	
	// MNetworkEnable
	bool m_bDroppable; // 0x590	
	// MNetworkEnable
	bool m_bPurchasable; // 0x591	
	// MNetworkEnable
	bool m_bSellable; // 0x592	
	// MNetworkEnable
	bool m_bInitiallySellable; // 0x593	
	// MNetworkEnable
	bool m_bForceUnsellable; // 0x594	
	// MNetworkEnable
	bool m_bRequiresCharges; // 0x595	
	// MNetworkEnable
	bool m_bKillable; // 0x596	
	// MNetworkEnable
	bool m_bGloballyCombinable; // 0x597	
	// MNetworkEnable
	bool m_bDisassemblable; // 0x598	
	bool m_bNeverDisassemble; // 0x599	
	bool m_bIsTempestDoubleClonable; // 0x59a	
	// MNetworkEnable
	bool m_bIsNeutralDrop; // 0x59b	
	// MNetworkEnable
	int32_t m_nNeutralDropTeam; // 0x59c	
	// MNetworkEnable
	bool m_bAlertable; // 0x5a0	
private:
	[[maybe_unused]] uint8_t __pad05a1[0x3]; // 0x5a1
public:
	// MNetworkEnable
	// MNetworkPriority "32"
	int32_t m_iInitialCharges; // 0x5a4	
	// MNetworkEnable
	bool m_bCastOnPickup; // 0x5a8	
	// MNetworkEnable
	bool m_bOnlyPlayerHeroPickup; // 0x5a9	
	// MNetworkEnable
	bool m_bCreepHeroPickup; // 0x5aa	
	// MNetworkEnable
	bool m_bCanBeUsedOutOfInventory; // 0x5ab	
	// MNetworkEnable
	bool m_bItemEnabled; // 0x5ac	
private:
	[[maybe_unused]] uint8_t __pad05ad[0x3]; // 0x5ad
public:
	// MNetworkEnable
	// MNetworkPriority "32"
	GameTime_t m_flEnableTime; // 0x5b0	
	// MNetworkEnable
	GameTime_t m_flReclaimTime; // 0x5b4	
	// MNetworkEnable
	bool m_bDisplayOwnership; // 0x5b8	
	// MNetworkEnable
	bool m_bShowOnMinimap; // 0x5b9	
private:
	[[maybe_unused]] uint8_t __pad05ba[0x2]; // 0x5ba
public:
	// MNetworkEnable
	float m_flMinimapIconSize; // 0x5bc	
	// MNetworkEnable
	bool m_bIsUpgradeable; // 0x5c0	
private:
	[[maybe_unused]] uint8_t __pad05c1[0x3]; // 0x5c1
public:
	// MNetworkEnable
	int32_t m_nUpgradeProgress; // 0x5c4	
	// MNetworkEnable
	int32_t m_nUpgradeGoal; // 0x5c8	
private:
	[[maybe_unused]] uint8_t __pad05cc[0x4]; // 0x5cc
public:
	// MNetworkEnable
	CNetworkUtlVectorBase< uint8 > m_vecPreGameTransferPlayerIDs; // 0x5d0	
	bool m_bStackWithOtherOwners; // 0x5e8	
	bool m_bTemporarilyUncombinable; // 0x5e9	
	bool m_bHasCommentedOnEquip; // 0x5ea	
private:
	[[maybe_unused]] uint8_t __pad05eb[0x1]; // 0x5eb
public:
	int32_t m_iDeclarationFlags; // 0x5ec	
	bool m_bCreatedByDisassemble; // 0x5f0	
	bool m_bHasMixedOwnership; // 0x5f1	
	bool m_bIsClonedItemProxy; // 0x5f2	
	bool m_bNeutralItemRequestDrop; // 0x5f3	
	// MNetworkEnable
	// MNetworkPriority "32"
	GameTime_t m_flPurchaseTime; // 0x5f4	
	// MNetworkEnable
	GameTime_t m_flAssembledTime; // 0x5f8	
	// MNetworkEnable
	// MNetworkPriority "32"
	int32_t m_iCurrentCharges; // 0x5fc	
	// MNetworkEnable
	int32_t m_iValuelessCharges; // 0x600	
	// MNetworkEnable
	int32_t m_iSecondaryCharges; // 0x604	
	// MNetworkEnable
	bool m_bCombineLocked; // 0x608	
private:
	[[maybe_unused]] uint8_t __pad0609[0x3]; // 0x609
public:
	CHandle< CDOTA_Item_Physical > m_hContainer; // 0x60c	
	// MNetworkEnable
	PlayerID_t m_iPlayerOwnerID; // 0x610	
	// MNetworkEnable
	bool m_bPurchasedWhileDead; // 0x614	
private:
	[[maybe_unused]] uint8_t __pad0615[0x3]; // 0x615
public:
	int32_t m_nCombineVersion; // 0x618	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x590
// Has VTable
// Construct allowed
// MClassHasEntityLimitedDataDesc
// MNetworkAssumeNotNetworkable
class CDOTA_Ability_Warlock_Fatal_Bonds : public CDOTABaseAbility
{
public:
	CUtlVector< CHandle< CBaseEntity > > m_FatalBondsEntities; // 0x578	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1338
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_Nian_Intrinsic : public CDOTA_Buff
{
public:
	// No schema binary for binding
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1338
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_Roshan_SpellBlock : public CDOTA_Buff
{
public:
	// No schema binary for binding
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x578
// Has VTable
// Construct allowed
// MClassHasEntityLimitedDataDesc
// MNetworkAssumeNotNetworkable
class CDOTA_Ability_Ursa_Enrage : public CDOTABaseAbility
{
public:
	// No schema binary for binding
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1340
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_Tinker_Warp_Grenade : public CDOTA_Buff
{
public:
	int32_t range_reduction; // 0x1338	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x580
// Has VTable
// Construct allowed
// MClassHasEntityLimitedDataDesc
// MNetworkAssumeNotNetworkable
class CDOTA_Ability_Tinker_HeatSeekingMissile : public CDOTABaseAbility
{
public:
	int32_t m_nTargetsKilled; // 0x578	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1340
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_Puck_PhaseShift_AttackBonus : public CDOTA_Buff
{
public:
	int32_t shard_bonus_damage; // 0x1338	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1340
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_DrowRanger_Marksmanship_Aura_Bonus : public CDOTA_Buff
{
public:
	int32_t agility_multiplier; // 0x1338	
	float agility_multiplier_ally; // 0x133c	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1348
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_Rune_Shield : public CDOTA_Buff
{
public:
	int32_t damage_absorb; // 0x1338	
	bool m_bStartedTimer; // 0x133c	
private:
	[[maybe_unused]] uint8_t __pad133d[0x3]; // 0x133d
public:
	int32_t m_nDamageAbsorbed; // 0x1340	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x578
// Has VTable
// Construct allowed
// MClassHasEntityLimitedDataDesc
// MNetworkAssumeNotNetworkable
class CDOTA_Ability_Special_Bonus_Unique_Wraith_King_5 : public CDOTABaseAbility
{
public:
	// No schema binary for binding
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x578
// Has VTable
// Construct allowed
// MClassHasEntityLimitedDataDesc
// MNetworkAssumeNotNetworkable
class CDOTA_Ability_Special_Bonus_Unique_Ogre_Magi_4 : public CDOTABaseAbility
{
public:
	// No schema binary for binding
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x578
// Has VTable
// Construct allowed
// MClassHasEntityLimitedDataDesc
// MNetworkAssumeNotNetworkable
class CDOTA_Ability_Special_Bonus_Attack_Range_150 : public CDOTABaseAbility
{
public:
	// No schema binary for binding
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x13f8
// Has VTable
// Construct allowed
// MClassHasEntityLimitedDataDesc
// MNetworkNoBase
// MNetworkAssumeNotNetworkable
// 
// MNetworkIncludeByName "m_iTeamNum"
// MNetworkVarNames "DataTeamPlayer_t m_vecDataTeam"
// MNetworkVarNames "uint64 m_bWorldTreeState"
// MNetworkVarNames "TreeModelReplacement_t m_vecWorldTreeModelReplacements"
// MNetworkVarNames "Vector2D m_vDesiredWardPlacement"
// MNetworkVarNames "int m_nEnemyStartingPosition"
// MNetworkVarNames "int m_nCaptainInspectedHeroID"
// MNetworkVarNames "float m_flSuggestedWardWeights"
// MNetworkVarNames "uint8 m_nSuggestedWardIndexes"
// MNetworkVarNames "int m_iSuggestedLanes"
// MNetworkVarNames "float m_iSuggestedLaneWeights"
// MNetworkVarNames "bool m_bSuggestedLaneRoam"
// MNetworkVarNames "bool m_bSuggestedLaneJungle"
// MNetworkVarNames "TierNeutralInfo_t m_vecNeutralItemsTierInfo"
// MNetworkVarNames "EHANDLE m_vecNeutralStashItems"
// MNetworkVarNames "AbilityID_t m_vecNeutralItemsConsumed"
// MNetworkVarNames "PingConfirmationState_t m_PingConfirmationStates"
// MNetworkVarNames "EHANDLE m_vecKnownClearCamps"
// MNetworkVarNames "Vector2D m_vPossibleWardPlacement"
// MNetworkVarNames "float m_vPossibleWardRadii"
// MNetworkVarNames "DOTATeleportInfo_t m_vecTrackedTeleports"
class CDOTA_DataNonSpectator : public CBaseEntity
{
public:
	// MNetworkEnable
	CUtlVectorEmbeddedNetworkVar< DataTeamPlayer_t > m_vecDataTeam; // 0x4a8	
	// MNetworkEnable
	// MNetworkEncoder "fixed64"
	uint64_t m_bWorldTreeState[256]; // 0x4f8	
	// MNetworkEnable
	CUtlVectorEmbeddedNetworkVar< TreeModelReplacement_t > m_vecWorldTreeModelReplacements; // 0xcf8	
	// MNetworkEnable
	Vector2D m_vDesiredWardPlacement[2]; // 0xd48	
	// MNetworkEnable
	int32_t m_nEnemyStartingPosition[5]; // 0xd58	
	// MNetworkEnable
	int32_t m_nCaptainInspectedHeroID; // 0xd6c	
	// MNetworkEnable
	float m_flSuggestedWardWeights[20]; // 0xd70	
	// MNetworkEnable
	uint8_t m_nSuggestedWardIndexes[20]; // 0xdc0	
	// MNetworkEnable
	int32_t m_iSuggestedLanes[5]; // 0xdd4	
	// MNetworkEnable
	float m_iSuggestedLaneWeights[5]; // 0xde8	
	// MNetworkEnable
	bool m_bSuggestedLaneRoam[5]; // 0xdfc	
	// MNetworkEnable
	bool m_bSuggestedLaneJungle[5]; // 0xe01	
private:
	[[maybe_unused]] uint8_t __pad0e06[0x2]; // 0xe06
public:
	// MNetworkEnable
	CUtlVectorEmbeddedNetworkVar< TierNeutralInfo_t > m_vecNeutralItemsTierInfo; // 0xe08	
	// MNetworkEnable
	CNetworkUtlVectorBase< CHandle< CBaseEntity > > m_vecNeutralStashItems; // 0xe58	
	// MNetworkEnable
	CNetworkUtlVectorBase< AbilityID_t > m_vecNeutralItemsConsumed; // 0xe70	
	// MNetworkEnable
	CUtlVectorEmbeddedNetworkVar< PingConfirmationState_t > m_PingConfirmationStates; // 0xe88	
	// MNetworkEnable
	CNetworkUtlVectorBase< CHandle< CBaseEntity > > m_vecKnownClearCamps; // 0xed8	
	// MNetworkEnable
	Vector2D m_vPossibleWardPlacement[100]; // 0xef0	
	// MNetworkEnable
	float m_vPossibleWardRadii[100]; // 0x1210	
	// MNetworkEnable
	CUtlVectorEmbeddedNetworkVar< DOTATeleportInfo_t > m_vecTrackedTeleports; // 0x13a0	
	int32_t m_iTowerKills; // 0x13f0	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1a20
// Has VTable
// Is Abstract
// MClassHasEntityLimitedDataDesc
// MNetworkAssumeNotNetworkable
// 
// MNetworkVarNames "int m_CompendiumChallengeEventID"
// MNetworkVarNames "int m_CompendiumChallengeSequenceID"
// MNetworkVarNames "int m_CompendiumChallengeCoinReward"
// MNetworkVarNames "int m_CompendiumChallengeCoinSplash"
// MNetworkVarNames "int m_CompendiumChallengePointReward"
// MNetworkVarNames "bool m_CompendiumChallengeCompleted"
// MNetworkVarNames "bool m_CompendiumChallengeFailed"
// MNetworkVarNames "int m_CompendiumChallengeProgress"
// MNetworkVarNames "int m_QueryIDForProgress"
// MNetworkVarNames "CDOTASubChallengeInfo m_SubChallenges"
// MNetworkVarNames "int m_CompendiumCoinWager"
// MNetworkVarNames "itemid_t m_CompendiumTokenWagerItemID"
// MNetworkVarNames "int m_CompendiumWagerTokenBonusPct"
// MNetworkVarNames "int m_CompendiumCoinWagerResults"
// MNetworkVarNames "int m_CompendiumRankWagers"
// MNetworkVarNames "float m_flWagerTimer"
// MNetworkVarNames "GameTime_t m_flWagerEndTime"
// MNetworkVarNames "CDOTA_PlayerChallengeInfo m_CompendiumChallengeInfo"
// MNetworkVarNames "CDOTA_CombatLogQueryProgress m_PlayerQueryIDs"
// MNetworkVarNames "int m_ProgressForQueryID"
// MNetworkVarNames "int m_GoalForQueryID"
// MNetworkVarNames "int m_PlayerQuestRankPreviouslyCompleted"
// MNetworkVarNames "int m_PlayerQuestRankCompleted"
// MNetworkVarNames "PlayerID_t m_PlayerBountyTarget"
// MNetworkVarNames "GameTime_t m_flPlayerBountyTimestamp"
// MNetworkVarNames "int m_PlayerBountyCount"
class CIngameEvent_Base : public CBaseEntity
{
private:
	[[maybe_unused]] uint8_t __pad04a8[0x20]; // 0x4a8
public:
	bool m_bInitialized; // 0x4c8	
private:
	[[maybe_unused]] uint8_t __pad04c9[0x3]; // 0x4c9
public:
	// MNetworkEnable
	int32_t m_CompendiumChallengeEventID[24]; // 0x4cc	
	// MNetworkEnable
	int32_t m_CompendiumChallengeSequenceID[24]; // 0x52c	
	// MNetworkEnable
	int32_t m_CompendiumChallengeCoinReward[24]; // 0x58c	
	// MNetworkEnable
	int32_t m_CompendiumChallengeCoinSplash[24]; // 0x5ec	
	// MNetworkEnable
	int32_t m_CompendiumChallengePointReward[24]; // 0x64c	
	// MNetworkEnable
	// MNetworkChangeCallback "OnClientPlayerChallengeProgressChanged"
	bool m_CompendiumChallengeCompleted[24]; // 0x6ac	
	// MNetworkEnable
	// MNetworkChangeCallback "OnClientPlayerChallengeProgressChanged"
	bool m_CompendiumChallengeFailed[24]; // 0x6c4	
	// MNetworkEnable
	// MNetworkChangeCallback "OnClientPlayerChallengeProgressChanged"
	int32_t m_CompendiumChallengeProgress[24]; // 0x6dc	
	// MNetworkEnable
	int32_t m_QueryIDForProgress[24]; // 0x73c	
private:
	[[maybe_unused]] uint8_t __pad079c[0x4]; // 0x79c
public:
	// MNetworkEnable
	CUtlVectorEmbeddedNetworkVar< CDOTASubChallengeInfo > m_SubChallenges; // 0x7a0	
	// MNetworkEnable
	// MNetworkChangeCallback "OnWagerChanged"
	int32_t m_CompendiumCoinWager[10]; // 0x7f0	
	// MNetworkEnable
	// MNetworkChangeCallback "OnWagerChanged"
	itemid_t m_CompendiumTokenWagerItemID[10]; // 0x818	
	// MNetworkEnable
	// MNetworkChangeCallback "OnWagerChanged"
	int32_t m_CompendiumWagerTokenBonusPct[10]; // 0x868	
	// MNetworkEnable
	int32_t m_CompendiumCoinWagerResults[10]; // 0x890	
	// MNetworkEnable
	// MNetworkChangeCallback "OnWagerChanged"
	int32_t m_CompendiumRankWagers[10]; // 0x8b8	
	// MNetworkEnable
	// MNetworkChangeCallback "OnWagerTimeChanged"
	float m_flWagerTimer; // 0x8e0	
	// MNetworkEnable
	GameTime_t m_flWagerEndTime; // 0x8e4	
	// MNetworkEnable
	CUtlVectorEmbeddedNetworkVar< CDOTA_PlayerChallengeInfo > m_CompendiumChallengeInfo; // 0x8e8	
	// MNetworkEnable
	// MNetworkTypeAlias "DOTA_CombatLogQueryProgress"
	CUtlVectorEmbeddedNetworkVar< CDOTA_CombatLogQueryProgress > m_PlayerQueryIDs; // 0x13a8	
	// MNetworkEnable
	// MNetworkChangeCallback "OnClientPlayerChallengeProgressChanged"
	int32_t m_ProgressForQueryID[100]; // 0x13f8	
	// MNetworkEnable
	int32_t m_GoalForQueryID[100]; // 0x1588	
	// MNetworkEnable
	int32_t m_PlayerQuestRankPreviouslyCompleted[10]; // 0x1718	
	// MNetworkEnable
	// MNetworkChangeCallback "OnClientPlayerQuestRankChanged"
	int32_t m_PlayerQuestRankCompleted[10]; // 0x1740	
	// MNetworkEnable
	PlayerID_t m_PlayerBountyTarget[10]; // 0x1768	
	// MNetworkEnable
	GameTime_t m_flPlayerBountyTimestamp[10]; // 0x1790	
	// MNetworkEnable
	int32_t m_PlayerBountyCount[10]; // 0x17b8	
	bool m_bHasSpentWager[10]; // 0x17e0	
	bool m_bPendingWagerSpend[10]; // 0x17ea	
	bool m_bCavernCrawlActive[24]; // 0x17f4	
	CavernCrawlMapVariant_t m_nCavernCrawlMapVariant[24]; // 0x180c	
	bool m_bCavernHalfCredit; // 0x1824	
	bool m_bBountyReminded[24]; // 0x1825	
	bool m_bBountyAnnounced[24]; // 0x183d	
private:
	[[maybe_unused]] uint8_t __pad1855[0x3]; // 0x1855
public:
	uint32_t m_pCavernCrawlWinnings[24]; // 0x1858	
	uint32_t m_pCavernCrawlPlusShardWinnings[24]; // 0x18b8	
	CUtlVector< DOTACavernCrawlMapResult_t >* m_ppVecCavernCrawlMapResult[24]; // 0x1918	
	int32_t m_event_lobby_updated; // 0x19d8	
};

// Registered binary: server.dll (project 'entity2')
// Alignment: 8
// Size: 0x8
// Has VTable
// Is Abstract
// Has Trivial Destructor
class CEntityComponent
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// No schema binary for binding
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1338
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_Stunned : public CDOTA_Buff
{
public:
	// No schema binary for binding
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x58
// Has VTable
// MNetworkAssumeNotNetworkable
// 
// MNetworkVarNames "int32 m_iGlowType"
// MNetworkVarNames "int32 m_iGlowTeam"
// MNetworkVarNames "int32 m_nGlowRange"
// MNetworkVarNames "int32 m_nGlowRangeMin"
// MNetworkVarNames "Color m_glowColorOverride"
// MNetworkVarNames "bool m_bFlashing"
// MNetworkVarNames "float m_flGlowTime"
// MNetworkVarNames "float m_flGlowStartTime"
class CGlowProperty
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	Vector m_fGlowColor; // 0x8	
private:
	[[maybe_unused]] uint8_t __pad0014[0x1c]; // 0x14
public:
	// MNetworkEnable
	// MNetworkChangeCallback "OnGlowTypeChanged"
	int32_t m_iGlowType; // 0x30	
	// MNetworkEnable
	int32_t m_iGlowTeam; // 0x34	
	// MNetworkEnable
	int32_t m_nGlowRange; // 0x38	
	// MNetworkEnable
	int32_t m_nGlowRangeMin; // 0x3c	
	// MNetworkEnable
	// MNetworkChangeCallback "OnGlowColorChanged"
	Color m_glowColorOverride; // 0x40	
	// MNetworkEnable
	bool m_bFlashing; // 0x44	
private:
	[[maybe_unused]] uint8_t __pad0045[0x3]; // 0x45
public:
	// MNetworkEnable
	float m_flGlowTime; // 0x48	
	// MNetworkEnable
	float m_flGlowStartTime; // 0x4c	
	bool m_bGlowing; // 0x50	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1340
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_Special_Bonus_20_Bash : public CDOTA_Buff
{
public:
	float value; // 0x1338	
	float value2; // 0x133c	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x620
// Has VTable
// Construct allowed
// MClassHasEntityLimitedDataDesc
// MNetworkAssumeNotNetworkable
class CDOTA_Item_Paladin_Sword : public CDOTA_Item
{
public:
	// No schema binary for binding
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1348
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_Item_AetherialHalo_Land : public CDOTA_Buff
{
public:
	int32_t impact_radius; // 0x1338	
	float land_time; // 0x133c	
	float burn_duration; // 0x1340	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1350
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_Item_Blade_Mail : public CDOTA_Buff_Item
{
public:
	int32_t bonus_damage; // 0x1338	
	int32_t bonus_armor; // 0x133c	
	int32_t bonus_intellect; // 0x1340	
	int32_t passive_reflection_constant; // 0x1344	
	int32_t passive_reflection_pct; // 0x1348	
	int32_t active_reflection_pct; // 0x134c	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1348
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_Phoenix_IcarusDiveBurn : public CDOTA_Buff
{
public:
	float burn_tick_interval; // 0x1338	
	int32_t damage_per_second; // 0x133c	
	int32_t slow_movement_speed_pct; // 0x1340	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x578
// Has VTable
// Construct allowed
// MClassHasEntityLimitedDataDesc
// MNetworkAssumeNotNetworkable
class CDOTA_Ability_Tusk_Launch_Snowball : public CDOTABaseAbility
{
public:
	// No schema binary for binding
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1348
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_Medusa_ManaShield : public CDOTA_Buff
{
public:
	int32_t bonus_mana; // 0x1338	
	float absorption_pct; // 0x133c	
	float damage_per_mana; // 0x1340	
	float illusion_damage_per_mana; // 0x1344	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x578
// Has VTable
// Construct allowed
// MClassHasEntityLimitedDataDesc
// MNetworkAssumeNotNetworkable
class CDOTA_Ability_ChaosKnight_Chaos_Strike : public CDOTABaseAbility
{
public:
	// No schema binary for binding
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x578
// Has VTable
// Construct allowed
// MClassHasEntityLimitedDataDesc
// MNetworkAssumeNotNetworkable
class CDOTA_Ability_Chen_DivineFavor : public CDOTABaseAbility
{
public:
	// No schema binary for binding
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x5a0
// Has VTable
// Construct allowed
// MClassHasEntityLimitedDataDesc
// MNetworkAssumeNotNetworkable
class CDOTA_Ability_Jakiro_DualBreath : public CDOTABaseAbility
{
public:
	CUtlVector< CHandle< CBaseEntity > > m_hHitHeroes; // 0x578	
	bool m_bGrantedGem; // 0x590	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1338
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_Broodmother_Tough : public CDOTA_Buff
{
public:
	// No schema binary for binding
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1348
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_DeathProphet_SpiritSiphon_Fear : public CDOTA_Buff
{
public:
	Vector m_vOriginal; // 0x1338	
};

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x1368
// Has VTable
// MNetworkAssumeNotNetworkable
class CDOTA_Modifier_PoisonNova_Thinker : public CDOTA_Buff
{
public:
	float m_fCurRadius; // 0x1338	
	GameTime_t m_fLastThink; // 0x133c	
	CUtlVector< CHandle< CBaseEntity > > m_entitiesHit; // 0x1340	
